{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Baldur Bjarnason",
  "feed_url": "https://www.baldurbjarnason.com/index.xml",
  "items": [
    {
      "id": "https://www.baldurbjarnason.com/2022/on-online-collaboration/",
      "url": "https://www.baldurbjarnason.com/2022/on-online-collaboration/",
      "title": "On online collaboration and our obligations as makers of software",
      "summary": "\nMy reading corner.\n\n\nThis post is the final entry of three in a series where I go over what I learned from the user research I’ve been doing for Colophon Cards. The first was about markdown. The second was about the various different kinds of notetaking.\nIt all began with blogging\nAs I’ve mentioned earlier in this series, I’ve been blogging for almost two decades. What I didn’t mention was that I was a true believer in ‘Blogging’.\n—So, you believed in having a personal website, what of it?\nNo, you see, at the time blogging was supposed to be so much more than that. I truly believed that it heralded the future of collaboration, communications, publishing, and intellectual discourse. I believed that the future of social media was an interconnected web of personal blogs. I believed that the future of intellectual discourse was in cross-blog debates on lofty topics.\nI believed the hype. I was quite wrong.\nBlogs didn’t quite die. You could even say that they won as they have become a cornerstone of the web’s infrastructure:\n\n40% of the web runs on WordPress, which is blog software.\nSubstack and similar newsletter platforms offer a reverse-chronological list of posts and an RSS feed and are basically rebranded blogs.\nPodcasts are blogging with audio files.\nThe affordances invented by blogs are everywhere. Many news sites maintain ongoing daily liveblogs on specific events, such as COVID-19 or the UK’s political scandal of the day. They may not call it a liveblog, but that’s what they are.\nMuch of the web’s automation is built on feed data that’s shuffled from service to service. Feeds are the quintessential blog tech.\nBlogs transformed how we approach content management systems (CMSes), even when those CMSes don’t use any blog-related design affordances.\nYoutuber video essays are an evolution of early attempts at “video blogging” or video-based podcasting.\n\nBlog tech underpins almost everything you see online.\nSo, while blogs didn’t quite have the profound effect on society, publishing, and media that I expected them to have, their influence is respectable and far-reaching.\nI am biased in favour of blogs, though. They had a major influence on my intellectual development, to the point where I still to this day revisit old blog post favourites for fresh inspiration.\nOne such major influence, one that probably changed my entire outlook on both writing and software development, was Kathy Sierra and her blog Creating Passionate Users. Her writing sent me down a path of studying the learning process, skills development, expertise, mastery, and why they matter to software development and UI design.\nAnd Kathy Sierra’s social media story—that began with a group of self-styled ‘mean kids’ revelling in mean jokes and ended with literal nazis calling for mass murder—is the reason why I fell out of love with weblogs and began to distrust the tech industry’s approach to social media and online collaboration.\n\nGetting back to notetaking, or the one where I piss off the punditry (again)\nI reject the ‘external brain’ hypothesis for notetaking.\nOr, more specifically, I think it’s a counterproductive metaphor for notetaking.\nThe hypothesis is straightforward: a complex notetaking system, built in the form of a structured web, acts as an extension of your brain and makes you smarter.\nThe theory is sometimes stated; sometimes merely implied. But it’s the trend among those making notetaking apps or selling courses on notetaking to talk as if structured, interlinked notetaking will raise your IQ, help you think more clearly, and prompt a wellspring of new ideas. Your collection of notes, dutifully linked and tagged, woven into an impenetrable fabric of collections and context, are therefore serious work and the promise is that all of that effort will be rewarded with intelligence, memory, and genius. The notetaking system is complex and tough to use because it’s supposed to expand the cognitive space that we use to structure our thoughts and generate ideas.\nThe problem is that even if our observations about these notetaking systems are correct, we don’t know if we have the arrow of causality pointing in the right direction.\nMaybe that German academic was a genius and he definitely used a complex notetaking system. But was he a genius because he had a complex and involved notetaking system? Or did a complex and involved system work for him because he was a genius?\nIs it the notetaking system that’s helping you think more clearly? Or is it the act of writing that forces you to clarify your thoughts?\nIs it the complex interlinked web of notes that helps you get new ideas? Or is it all the reading you’re doing to fill that notetaking app bucket?\nIs all of this notetaking work making you smarter? Or is it just indirectly forcing you into deliberate, goalless practice?\nIf the external brain hypothesis is correct, then complexity is essential. You can’t have a neurological extension of the brain without neurological complexity. The involved structures and regimented processes exist to tap into specific structures in our brain. There might be variations but all should have a baseline complexity that can’t be abstracted away because, hey, the brain is complex.\nThat’s the theory, at least.\nHowever, if my suspicions are correct, then the primary benefit from notetaking comes from regular, deliberate practice. It doesn’t matter if you’re sketching, journaling, collaging, jotting down bullet points, recording a daily video, or just writing. It doesn’t matter if you’re filing it all away with a detailed ontology into a structured database or if you’re dumping it all into a box. It’s the habitual practice—in a way that fits your skill, personality, and practices—that matters.\nIf I’m right, then you can get the results of a complex notetaking system with a lot less work. Or, to be more specific, with a lot less wasted work—it should all go into the writing (or sketching, recording, etc.).\nThe key is that the object of notetaking is never to take notes. It’s to do a better job:\n\nBuild better software.\nWrite better blog posts or finally finish that novel.\nRenovate that spare bedroom into something nice.\nBecome more thoughtful about what you buy and eat.\nWrite a better thesis.\nMake better art.\nTake better photographs.\n\nNotetaking should always be less work than the actual work you’re doing. When the notetaking process takes over, something has gone seriously wrong.\n\nHow blogs influenced my thinking on the subject\nKathy Sierra’s work has a single recurring idea from the very beginning of her first blog, Creating Passionate Users to her amazing 2015 book Badass: Making Users Awesome: the job of the tools we make is to set the user on a path of mastery. The tool shouldn’t get in the way of them improving their skills. It shouldn’t overload the UI with distractions. It should enable experimentation and practice. It should be designed in such a way as to enable and foster mastery.\nThat requires us to understand what mastery and skills development is, how it comes from deliberate goalless practice, exposure to examples of work that exhibit the skills the user aspires to, from having a tight feedback loop that lets the end user be aware of how they are working when they need to, from increasing the resolution of the work when applicable. And the generally accepted key to mastery (or skill-specific expertise, if you want to be nitpicky), is twofold: deliberate practice and perceptual knowledge.\nIn Kathy Sierra’s words, from her book Badass, first on practice:\n\nPracticing harder and longer can potentially make us even worse than if we did less practicing.\nBuilding deep expertise takes work, but of a very specific type that’s often the opposite of what people do when practicing.\nPractice does not make perfect\n\nOn perceptual knowledge:\n\nThe second attribute of those who became experts is this: they were exposed to high quantity, high quality examples of expertise. (page 128)\n\n\nAfter enough exposure with feedback, your brain began detecting patterns and underlying structures, without your conscious awareness. With more exposure, your brain fine-tuned its perception and eventually figured out what really mattered. Your brain was making finer distinctions and sorting signal from noise even if you couldn’t explain how. (page 133)\n\nThese two ideas, deliberate practice and exposure to high-quality examples, should be the forces that drive the design and structure of most apps. That includes Colophon Cards.\n\nThe research so far\nAs I wrote in my last entry, I began my research into writing and notetaking well before I began the Colophon Cards project itself. I came to the project with a set of ideas. I’d based them on my research of existing studies and writing about expertise, mastery, creative work, and knowledge work. (And I reviewed a ton of forum threads on notetaking.)\nThe purpose of the survey and the interviews was to see if I could validate or invalidate some of my guesses before I advance to the implementation stage proper. Better now than after I’ve implemented something.\n\nThe survey helped me get a sense of the overall notetaking “enthusiast” scene and lent support to my theory that there is a core group of active users who are open to trying new apps.\nIt helped me decide how to approach text formatting; whether to implement rich text or markdown.\nIt gave me the tools and context to outline a categorisation of the various approaches to notetaking and gave me the framework to more clearly define and describe the approach I’m going to try out.\nIt allowed me to test out a variety of static UI mockups to figure out the broad strokes of what worked and what didn’t.\n\nFinally, writing these entries where I analyse and outline the observations from the interviews while explaining where they stand relative to my other research, helped me consolidate my ideas into a cohesive theory of how a subset of the notetaking field works.\nThe research I’ve done isn’t enough to lend my theories scientific legitimacy (for that I’d need way more money) but it’s enough to give me confidence in going forward.\nMy hunches:\n\nWhen it comes to notetaking, knowledge work (e.g. most kinds of office work that require expertise of some sort) has more in common with creative work than not and benefits from similar approaches.\nThat most kinds of notetaking don’t need complex organisational structures.\nThat two-dimensional spaces (like a pinboard) are underused as organisational metaphors in creative software.\nThat most of the usefulness of notetaking doesn’t come from a system, organisation, or references but the act of writing.\nThat, ultimately, the goal of the notetaking is to make something for somebody else.\n\nThere are many kinds of notes, but these are the kinds of notes I’m hoping to support. The app should help those in creative or knowledge work become better at their jobs.\nMost of these kinds of jobs involve other people.\nCouple that with the need for the high-quality examples required for mastery and the key to a great personal notetaking app is then, paradoxically, other people.\nOther people (the various types of collaboration)\nIt can be jarring to listen to people describe the many ways they work with other people. Especially if you’re only used to the limited takes on collaboration that are the norm in the software industry.\nTech today favours only two approaches to collaborative work:\n\nMultiplayer spaces that are shared in real time (or close to real time).\nA library where everybody sees and contributes to the same shared space.\n\nBoth are essentially the same idea: a space with realtime synchronisation and presence signalling; and a space without.\nExamples of the former include Google Docs, Slack, Figma, and Zoom. Their design makes you aware of everybody else in the space, and their actions affect your perception of that space in real time (or close to real time).\nExamples of the latter include Wikipedia, various kinds of knowledge bases, Dropbox and Google Drive, and version control systems. They are all about making it easy for a group of people to work simultaneously in a space but without realtime awareness of each others actions.\nThe makers of both kinds of apps often invest a lot of engineering hours into making sure that multiple people can work on the same document or file at the same time without causing conflicts or losing data.\nOther approaches that used to have favour in tech but are now out of fashion, despite their evident popularity among end users:\n\nForums and discussion groups. Arguably the world’s favourite form of online collaboration, used for everything from coordinating the development of multi-million dollar software projects to a family picnic.\nEmail: a federated messaging system where each user gets a personal data repository to manage shared data and messages.\nFolksonomy or collaborative tagging. Helps groups of people organise an ad hoc library of documents, web pages, or files.\n\nMost discussions of how to make collaborative software focus on one or more of these approaches.\nThis is like describing a chair in terms of the hammers, saws, and screwdrivers used to make it. Great when talking to other carpenters who want to make another exactly like it. Not so great when you want to find out whether the chair works for sitting.\nWe need to have a clear idea of what people are trying to accomplish with collaboration. Knowing the tools we can provide them with as UX designers is not enough.\nA non-exhaustive list of the primary goals of most collaborative office work:\n\nConsensus-building.\nFeedback and review.\nKnowledge sharing.\nParallel work.\n\nConsensus-building\nThe point of most meetings, brainstorming sessions, and workplace discussions isn’t to generate ideas, make decisions, or understand the situation. The point is to build consensus. The ideas or decisions are the most straightforward part of the process. Without consensus, they are all meaningless.\nConstructive examples from the interviews include:\n\nMeeting minutes in Google Docs or Hack.md to make sure that they reflect the group’s consensus on what was said and decided.\nPlan of action proposals that needed to be approved by several people to happen.\n\nFor consensus-building, you need everybody to have an overview of what everybody has said, who has participated, and what the overall argument has been.\nAny time you have a group of people together where everybody is aware of everybody else’s presence and status, you tend to automatically end up with a group consensus, even if that wasn’t what you wanted. We are a social species, and we are really good at adjusting our own opinions to match that of the crowd.\nThe Bandwagon Effect (and the equal and opposite anti-Bandwagon Effect) is what drives most online social interactions. It’s what tore blogs apart; what makes Twitter a hellsite; and what turned Facebook into the propaganda machine it is today.\nIt also tends to lead to bad outcomes in collaborative work.\nConsensus-building is an essential part of work collaboration but it can’t be the only part. The dominance of consensus-building online collaboration tools directly leads to worse decisions.\nHere’s Kathy Sierra again talking about how this phenomenon is described in the book The Wisdom of Crowds (which, paradoxically, talks a lot about how crowds are dumb):\n\nAnd that’s all great and intuitive… until you get to humans. Humans, he said, demonstrate the opposite principle: more interactions equals dumber behavior. When we come together and interact as a group seeking consensus, we lose sophistication and intelligence. Ants get smarter while we get dumber.\n\nAnd.\n\nAt its simplest form, it means that if you take a bunch of people and ask them (as individuals) to answer a question, the average of each of those individual answers will likely be better than if the group works together to come up with a single answer.\n\nFeedback and review\nAnother common scenario is to get feedback or a review of an idea, proposal, or piece of work. You have a thing. You would like to improve said thing. So, you ask a bunch of people what they think, giving more weight to those with relevant expertise. It’s a time-tested strategy.\nThe pitfall here is that if the participants are aware of each other’s contributions, they will almost always automatically switch to consensus-building instead of providing their honest feedback. Worst case scenario: the bandwagon effect gathers steam and drives you toward a crap decision.\nThese kinds of disasters are a routine occurrence today. You see them in corporations, small and large, in movie studios, at publishing houses, and in governments. A product or project is released and all of a sudden you have a bunch of people in your inbox pointing out glaring, obvious, and fatal flaws that everybody involved had missed.\nTo get the best feedback possible from the participants, you need to avoid the mechanisms of consensus-building. You need to ensure that everybody’s responses are kept separate and only visible to those responsible for integrating all of the feedback, something that’s surprisingly difficult to accomplish in modern collaborative software.\nThe interviewees all had examples where they needed to get feedback from a specific person on something they did. But only those who were specifically writing or teaching as a part of their job did feedback in a structured way. Most of the examples of feedback or reviews that came up in the interviews were more accurately examples of consensus building as described above as they all involved:\n\nGroups of people.\nWho could see each other’s work.\nAnd who debated until they all agreed.\n\nThat’s just the consensus trap all over again. Which is fine, if that’s what you actually wanted, but counterproductive if needed that feedback.\nKnowledge sharing\nThis is the one everybody loves to try to solve because it’s a problem that everybody seems to have. The reasoning is straightforward and compelling:\n\nMost organisations have a lot of documents and data floating around that hardly ever gets revisited or used.\nThey all have research, reading, and relevant information collecting dust.\n\nStuff that should be informing the decisions and strategies of the company. Some of it sits unread in a knowledge base or a wiki. Some of it lies in the drives of individual employees who don’t have a way to share it productively.\nSo much knowledge not being applied!\nExcept that’s not how we work as human beings. If you haven’t read it, experienced it, and contextualised it, then it isn’t knowledge to you. Knowledge is a quality that people possess, not documents, and the only way to transfer it from one place to another is for people at both ends to apply themselves and make it their own.\nIn terms of preserving and transmitting knowledge, most of the systems being used are working about as well as they ever can, and even if you could improve upon them, it’s highly unlikely that anybody would pay you for that improvement as it’s a pizza crust problem, to use a phrase coined by Amy Hoy.\nUsing the term “knowledge” for knowledge sharing and knowledge bases is misleading. It’s the term of art, but it’s also wrong enough to lead you to make poor decisions. We should be talking about documentation and references. In other words: a library. At scale, when you’re dealing with a large collection of documents and papers, you’re probably big enough to hire somebody (or a team of somebodies) with an information science degree (or degrees).\nIf you’re big enough to have a library where everything gets lost all the time but still too small to hire people who have the relevant expertise to solve the problem, you’re kind of screwed. Search only works up to a point.\nThankfully, if keep your scope limited (small organisation or single department) there’s this neat thing that digital files can do that saves the day: digital files can be in multiple places at the same time.\nThe issue with large shared document libraries at most companies is:\n\nThey generally don’t have an organising principle beyond the personal tastes of the employee who volunteered to organise the Google Drive.\nIf they do have an organising principle, it isn’t understood by most of those who use it, which leads them to move things around and leave items in the wrong place.\nAlmost every time somebody puts a document in a place that makes sense to them, it’s lost to everybody else.\n\nInformation science people know how to solve these problems and others that come up, but what if you don’t have one of those hanging around?\nThe simplest solution, one that works surprisingly often, is for everybody to maintain their organisation for the document library.\nTo use the shelf analogy: if you have a large enough shared bookshelf and you move a book to a place that makes sense to you, then that book is immediately lost to those who knew where it was in the old place.\nIf you, on the other hand, have a bookshelf for each employee and unlimited copies of all of the books, then each person can organise their version of the library in a way that they understand and can navigate easily.\nIf you ever wondered why every office has at least one person who emails themselves everything—files, PDFs, pictures, whatever—now you know.\nThis approach has obvious limitations. It’s crap at helping you find stuff that came up before you started work in the organisation and it doesn’t scale to a large organisation.\nA bookmarking service that supports collaborative tagging (folksonomies) can often fill in that gap.\nDoesn’t always work. Even when it doesn’t, it’s probably still going to be better than the black hole of data that passes as your shared Google Drive or Dropbox.\nAlmost everybody I interviewed described knowledge sharing as an ideal they aspired to but none of them practised it.\nParallel work\nFinally, we get to the other kind of collaboration that modern software is good at (the first being consensus-building, which apps and the web excel at, to a fault).\nNamely, working people down to the bone—I mean, helping people work in parallel.\nWith Google Docs, you can get a group of writers to work in parallel on whichever part of the document you want. With Git, a group of developers can be working on separate problems in the same codebase without issue. With Figma, you can have all of your designers working on your design library at the same time and the app will handle it without a hiccup.\nThis can be great and this can be awful. The great part is obvious: sometimes you can sic a bunch of people at a problem and they’ll tear it apart. But also sometimes a problem can only be solved by a single person with expertise and others would only get in their way.\nThe risk with these tools is that they are also frequently inadvertent consensus engines. Because tools like Google Docs and Figma show the work in a single shared space and make you aware of the actions and presence of others working in said space they end up having the same drive towards consensus as you get in UIs specifically designed to help a group come to a consensus.\nAmazing division of labour; mediocre outcomes.\nIn Kathy Sierra’s words:\n\nI’m not dissing teams–our books are all collaborative efforts, and far better because of it. And we consider ourselves to be on a team that includes our publisher O’Reilly. It’s not teams that are the problem, it’s the rabid insistence on teamwork. Group think. Committee decisions.\nMost truly remarkable ideas did not come from teamwork. Most truly brave decisions were not made through teamwork. The team’s role should be to act as a supportive environment for a collection of individuals. People with their own unique voice, ideas, thoughts, perspectives. A team should be there to encourage one another to pursue the wild ass ideas, not get in lock step to keep everything cheery and pleasant.\n\nEverybody I interviewed had experience with parallel work, thanks to Google Docs. They all mentioned having worked on a document or a spreadsheet in parallel with others as a part of their job. The developers all used GitHub as well.\nPutting it all together\n—This sounds impossible! Might as well give up.\nIt would be impossible if you tried to solve all of the problems I’ve described with one app. Instead what the research helped me do is narrow down the focus of the app and validate or invalidate some of my assumptions.\nAs I described in the first entry in this series, heavy users in the notetaking scene are extraordinarily sensitive to lock-in and interoperability. While I’m hesitant to base the app on markdown—I think the format is a major roadblock for many on the path to master writing and notetaking—I need to make sure the app offers similar interop and compatibility guarantees as you get from a plain text format.\nIn the second entry I described the different kinds of notetaking people use. The research helped me decide that I wanted to focus on making a notetaking app for structured creative work, operating on the assumption that knowledge work has more in common with creative work than not. I also reviewed some of the different ways experienced writers commonly structure their notes and research, focusing on two that I called The Box and The Map.\nAnd in this entry, I’ve been describing how practice and feedback are a vital part of helping people develop skills and expertise.\nThrough this work I’ve been finessing the concept of the app and cutting it down to four main spaces or views, each with a specific purpose, all connected through feedback loops.\n\nThe Journal\nThe Dot Grid\nThe Reading Corner\nThe Sharing Space\n\nThe Journal is your entry point. It ties everything together and prompts you to describe or contextualise the notes and bookmarks that you’ve added, edited, or deleted that day. As I described in my last entry, almost every book on writing or creative work strongly recommends a daily, goalless journal. It needs to be daily (or close to daily) because it’s practice. It needs to be goalless because it’s deliberate practice. You aren’t writing it to meet a deadline or finish a project. It’s there for you to empty your head, so to speak.\nThe Dot Grid is The Box. It’s the semi-structured space you use to collect your things.\nRoy Peter Clark uses literal boxes, one for each project, and describes the process in his book Writing Tools in terms of saving string in a box:\n\nTo save string, I need a simple file box. I prefer the plastic ones that look like milk crates. I display the box in my office and put a label on it, say “The Plight of Boys.” As soon as I declare my interest in an important topic, a number of things happen. I notice more things about my topic. Then I have conversations about it with my friends and colleagues. They feed my interest. One by one, my box fills with items: an analysis of graduation rates of boys versus girls; a feature on whether video games help or hinder the development of boys; a story about decreasing participation by boys in high school sports. This is a big topic, so I take my time. Weeks and weeks pass, sometimes months and months, and one day I’ll look over at my box and hear it whisper, “It’s time.” I’m amazed at its fullness, and even more astonished at how much I’ve learned just by saving string. (p. 215)\n\nThe Reading Corner is where you read and review both the articles you’ve bookmarked and your own notes. It’s important when reviewing other people’s writing and your own that both happen in an identical environment. In theory, it should strengthen your perceptual knowledge to edit your writing in the same space as you read the (presumably) high-quality research that you’ve collected.\nFinally, The Sharing Space is the same as The Reading Corner except it’s specifically for getting feedback from other people. You should be able to take a note or a draft and get independent feedback from each of your reviewers.\nThat’s the theory and the concept. This is what I hope Colophon Cards will be.\n\nOur obligation as makers of software, as explained by the collapse of the blogosphere\nIn early 2007, a small group of popular bloggers started a site called Mean Kids, a tongue in cheek reference to some of the participants having previously been likened to “the mean kids in high school”. It claimed to be satire that poked fun at some of the people in the blogging world that annoyed them. That included Kathy Sierra (among others, it was a really mean-spirited effort).\nThe problem with the Bandwagon Effect and the anti-Bandwagon Effect online is that it leads to escalation. Everything keeps escalating unless you specifically take measures to prevent it, right at the beginning, which this group didn’t (out of ideological opposition to content moderation) until it was too late. The tech industry is filled with well-meaning enablers of abuse and 2007 wasn’t any different.\nThese events were well documented at the time. This take, by Joseph Reagle, is as good as any.\nThe man who escalated the furthest was Andrew “Weev” Auernheimer who has since confessed several times to not only spreading lies about Kathy Sierra but also publishing her home address and social security number, encouraging people to send her ‘presents’ that showed what they thought of her.\nAnd they did. Some of them were death threats.\nSo, Kathy stopped speaking publicly and stopped blogging. She retreated from the public web while Weev rose to stardom as a ‘hacktivist’. Many people in tech adored him for fighting against unfair laws that ‘stifled’ progress in the industry.\nThis is when I lost faith in blogs and online social media. This dynamic, repeated endlessly since then, is why distributed social media like the ‘blogosphere’ collapses; why Twitter is a hellsite; why Facebook is the place that turns Granddad into a nazi; why federated social media like Mastodon breaks apart into smaller isolated clusters.\nThe tech industry either doesn’t understand the harm being done by their idea of how social interactions work or it doesn’t care.\nMore than any other, this is the event that made me a sceptic of the promises of progress that the software industry is fond of making. It hammered home the obligation the rest of us have, those who do care, in making sure that the software and technology that we work on don’t enable the kinds of abuse and harm that keeps happening with mainstream social and collaborative media.\nNo app I make or work on should prioritise collaboration and work over the well-being of others. The obscurity or lack of popularity of my software or yours should not be the only thing that prevents it from being used for abuse.\n\nKathy Sierra returned to social media and the public web in 2013, joining Twitter as seriouspony and launching a website to promote her upcoming book.\nFor a while it seemed to be going well. The book, after all, is amazing. I highly recommend it. But then the crap kept coming. People kept repeating the lies Weev had told about her. He kept being heralded as a hacktivist and an important man in the fight against government overreach. Every time she tried to push back against the lies, she ended up being the one accused of being a troll.\nThe tech industry loves its abusive dudes.\nSo, she decided to stop. Only a few months after her return, she wrote a post explaining why, republished by Wired as Why the Trolls Will Always Win:\n\nI don’t have the luxury of assuming “it’s just online. Not REAL. It’s not like these people would ever do anything in the real world.” And what you don’t hear much about is what most targeted women find the most frightening of all: the stalkerish energy, time, effort, focus on… YOU. The drive-by hate/threat comment, no matter how vile, is just that, a comment that took someone 2.5 seconds to think and execute. It might be annoying, offensive, maybe intimidating the first few times. But you get used to those, after all, it’s not like somebody put time and effort into it.\nBut Photoshopped images? Stories drawn from your own work? There’s a creepy and invasive horror knowing someone is pouring over your words, doing Google and Flickr image searches to find the perfect photo to manipulate. That someone is using their time and talent to write code even, about you. That’s not trolling, that’s obsession. That’s the point where you know it’s not really even about the Koolaid now…they’re obsessed with you.\nThis is a very long way from the favorite troll talking point “Oh boohoo someone was mean on the internet.”\n\nBeing online wasn’t worth the risk, so she left.\nSince then Weev came out as a Nazi, got himself a swastika tattoo, and more than once has excused or advocated for mass murder while maintaining one of the more prominent online neo-nazi communities.\nDespite this, I haven’t seen a single person who took his side over Kathy Sierra’s recant and apologise. Many instead doubled down, saying that in principle they were correct to defend a nazi’s freedom of speech.\nAt most, when you press them, you get a vague apology about how in nerd circles you have to have a tolerance for strange politics. Which is why it was apparently impossible for them to register what sort of person Weev was until it was too late.\nIt should worry you that these people, and others with similar priorities and similarly poor judgement, are still so influential in the tech industry.\nAnd the rest of us need to try to be better.\nThe next steps for Colophon Cards\nNext, it’s time to start implementing the prototype proper and start testing actual designs.\n\nThe Colophon Cards project is made possible by a grant from The Icelandic Centre for Research’s Technology Development Fund",
      "content_html": "<figure><img src=\"https://www.baldurbjarnason.com/images/2022/notes/reading-corner-1.jpg\" alt=\"My reading corner at home. An old comfy chair. Bookcases. Books stacked\">\n<figcaption>My reading corner.</figcaption>\n</figure>\n<hr>\n<p>This post is the final entry of three in a series where I go over what I learned from the user research I&rsquo;ve been doing for <a href=\"https://www.colophon.cards/\">Colophon Cards</a>. The first <a href=\"https://www.baldurbjarnason.com/2022/why-people-use-markdown/\">was about markdown</a>. The second was about the various <a href=\"%5B/2022/the-different-kinds-of-notes/%5D(https://www.baldurbjarnason.com/2022/the-different-kinds-of-notes/)\">different kinds of notetaking</a>.</p>\n<h2 id=\"it-all-began-with-blogging\">It all began with blogging</h2>\n<p>As I&rsquo;ve mentioned earlier in this series, I&rsquo;ve been blogging for almost two decades. What I didn&rsquo;t mention was that I was a true believer in &lsquo;Blogging&rsquo;.</p>\n<p>&mdash;<em>So, you believed in having a personal website, what of it?</em></p>\n<p>No, you see, at the time blogging was supposed to be so much more than that. I truly believed that it heralded the future of collaboration, communications, publishing, and intellectual discourse. I believed that the future of social media was an interconnected web of personal blogs. I believed that the future of intellectual discourse was in cross-blog debates on lofty topics.</p>\n<p>I believed the hype. I was quite wrong.</p>\n<p>Blogs didn&rsquo;t quite die. You could even say that they won as they have become a cornerstone of the web&rsquo;s infrastructure:</p>\n<ul>\n<li>40% of the web runs on WordPress, which is blog software.</li>\n<li>Substack and similar newsletter platforms offer a reverse-chronological list of posts and an RSS feed and are basically rebranded blogs.</li>\n<li>Podcasts are blogging with audio files.</li>\n<li>The affordances invented by blogs are everywhere. Many news sites maintain ongoing daily liveblogs on specific events, such as COVID-19 or the UK&rsquo;s political scandal of the day. They may not call it a liveblog, but that&rsquo;s what they are.</li>\n<li>Much of the web&rsquo;s automation is built on feed data that&rsquo;s shuffled from service to service. Feeds are the quintessential blog tech.</li>\n<li>Blogs transformed how we approach content management systems (CMSes), even when those CMSes don&rsquo;t use any blog-related design affordances.</li>\n<li>Youtuber video essays are an evolution of early attempts at &ldquo;video blogging&rdquo; or video-based podcasting.</li>\n</ul>\n<p>Blog tech underpins almost everything you see online.</p>\n<p>So, while blogs didn&rsquo;t quite have the profound effect on society, publishing, and media that I expected them to have, their influence is respectable and far-reaching.</p>\n<p>I am biased in favour of blogs, though. They had a major influence on my intellectual development, to the point where I still to this day revisit old blog post favourites for fresh inspiration.</p>\n<p>One such major influence, one that probably changed my entire outlook on both writing and software development, was Kathy Sierra and her blog <a href=\"https://headrush.typepad.com/creating_passionate_users/\"><em>Creating Passionate Users</em></a>. Her writing sent me down a path of studying the learning process, skills development, expertise, mastery, and why they matter to software development and UI design.</p>\n<p>And Kathy Sierra&rsquo;s social media story&mdash;that began with a group of self-styled &lsquo;mean kids&rsquo; revelling in mean jokes and ended with literal nazis calling for mass murder&mdash;is the reason why I fell out of love with weblogs and began to distrust the tech industry&rsquo;s approach to social media and online collaboration.</p>\n<hr>\n<h2 id=\"getting-back-to-notetaking-or-the-one-where-i-piss-off-the-punditry-again\">Getting back to notetaking, or the one where I piss off the punditry (again)</h2>\n<p>I reject the &lsquo;external brain&rsquo; hypothesis for notetaking.</p>\n<p>Or, more specifically, I think it&rsquo;s a counterproductive metaphor for notetaking.</p>\n<p>The hypothesis is straightforward: a complex notetaking system, built in the form of a structured web, acts as an extension of your brain and makes you smarter.</p>\n<p>The theory is sometimes stated; sometimes merely implied. But it&rsquo;s the trend among those making notetaking apps or selling courses on notetaking to talk as if structured, interlinked notetaking will raise your IQ, help you think more clearly, and prompt a wellspring of new ideas. Your collection of notes, dutifully linked and tagged, woven into an impenetrable fabric of collections and context, are therefore serious <em>work</em> and the promise is that all of that effort will be rewarded with intelligence, memory, and genius. The notetaking system is complex and tough to use because it&rsquo;s supposed to expand the cognitive space that we use to structure our thoughts and generate ideas.</p>\n<p>The problem is that even if our observations about these notetaking systems are correct, we don&rsquo;t know if we have the arrow of causality pointing in the right direction.</p>\n<p>Maybe that German academic was a genius and he definitely used a complex notetaking system. But was he a genius because he had a complex and involved notetaking system? Or did a complex and involved system work for him <em>because</em> he was a genius?</p>\n<p>Is it the notetaking system that&rsquo;s helping you think more clearly? Or is it the act of writing that forces you to clarify your thoughts?</p>\n<p>Is it the complex interlinked web of notes that helps you get new ideas? Or is it all the reading you&rsquo;re doing to fill that notetaking app bucket?</p>\n<p>Is all of this notetaking work making you smarter? Or is it just indirectly forcing you into deliberate, goalless practice?</p>\n<p>If the external brain hypothesis is correct, then complexity is essential. You can&rsquo;t have a neurological extension of the brain without neurological complexity. The involved structures and regimented processes exist to tap into specific structures in our brain. There might be variations but all should have a baseline complexity that can&rsquo;t be abstracted away because, hey, the brain <em>is</em> complex.</p>\n<p>That&rsquo;s the theory, at least.</p>\n<p>However, if my suspicions are correct, then the primary benefit from notetaking comes from regular, deliberate practice. It doesn&rsquo;t matter if you&rsquo;re sketching, journaling, collaging, jotting down bullet points, recording a daily video, or just <em>writing</em>. It doesn&rsquo;t matter if you&rsquo;re filing it all away with a detailed ontology into a structured database or if you&rsquo;re dumping it all into a box. It&rsquo;s the habitual practice&mdash;in a way that fits your skill, personality, and practices&mdash;that matters.</p>\n<p><em>If</em> I&rsquo;m right, then you can get the results of a complex notetaking system with a lot less work. Or, to be more specific, with a lot less <em>wasted</em> work&mdash;it should all go into the writing (or sketching, recording, etc.).</p>\n<p>The key is that the object of notetaking is never to take notes. It&rsquo;s to do a better job:</p>\n<ul>\n<li>Build better software.</li>\n<li>Write better blog posts or finally finish that novel.</li>\n<li>Renovate that spare bedroom into something nice.</li>\n<li>Become more thoughtful about what you buy and eat.</li>\n<li>Write a better thesis.</li>\n<li>Make better art.</li>\n<li>Take better photographs.</li>\n</ul>\n<p>Notetaking should <em>always</em> be less work than the actual work you&rsquo;re doing. When the notetaking process takes over, something has gone seriously wrong.</p>\n<hr>\n<h2 id=\"how-blogs-influenced-my-thinking-on-the-subject\">How blogs influenced my thinking on the subject</h2>\n<p>Kathy Sierra&rsquo;s work has a single recurring idea from the very beginning of her first blog, Creating Passionate Users to her amazing 2015 book <a href=\"http://seriouspony.com/badass-users-the-book\"><em>Badass: Making Users Awesome</em></a>: the job of the tools we make is to set the user on a path of mastery. The tool shouldn&rsquo;t get in the way of them improving their skills. It shouldn&rsquo;t overload the UI with distractions. It should enable experimentation and practice. It should be designed in such a way as to enable and foster mastery.</p>\n<p>That requires us to understand what mastery and skills development is, how it comes from deliberate goalless practice, exposure to examples of work that exhibit the skills the user aspires to, from having a tight feedback loop that lets the end user be <em>aware</em> of how they are working when they need to, from increasing the resolution of the work when applicable. And the generally accepted key to mastery (or skill-specific expertise, if you want to be nitpicky), is twofold: deliberate practice and perceptual knowledge.</p>\n<p>In Kathy Sierra&rsquo;s words, from her book <em>Badass</em>, first on practice:</p>\n<blockquote>\n<p>Practicing harder and longer can potentially make us even <em>worse</em> than if we did <em>less</em> practicing.</p>\n<p>Building deep expertise takes work, but of a <strong>very specific type</strong> that&rsquo;s often the opposite of what people do when practicing.</p>\n<p><strong><em>Practice does not make perfect</em></strong></p>\n</blockquote>\n<p>On perceptual knowledge:</p>\n<blockquote>\n<p>The <em>second</em> attribute of those who became experts is this: <strong><em>they were exposed to high quantity, high quality examples of expertise.</em></strong> (page 128)</p>\n</blockquote>\n<blockquote>\n<p>After enough exposure with feedback, your brain began detecting patterns and underlying structures, without your conscious awareness. With <em>more</em> exposure, your brain fine-tuned its perception and eventually figured out what <em>really</em> mattered. Your brain was making finer distinctions and sorting signal from noise even if <em>you</em> couldn&rsquo;t explain how. (page 133)</p>\n</blockquote>\n<p>These two ideas, deliberate practice and exposure to high-quality examples, should be the forces that drive the design and structure of most apps. That includes Colophon Cards.</p>\n<hr>\n<h2 id=\"the-research-so-far\">The research so far</h2>\n<p>As I <a href=\"https://www.baldurbjarnason.com/2022/the-different-kinds-of-notes/\">wrote in my last entry</a>, I began my research into writing and notetaking well before I began the Colophon Cards project itself. I came to the project with a set of ideas. I&rsquo;d based them on my research of existing studies and writing about expertise, mastery, creative work, and knowledge work. (And I reviewed a <em>ton</em> of forum threads on notetaking.)</p>\n<p>The purpose of the survey and the interviews was to see if I could validate or invalidate some of my guesses before I advance to the implementation stage proper. Better now than after I&rsquo;ve implemented something.</p>\n<ul>\n<li><a href=\"https://www.colophon.cards/notes/survey-results/\">The survey helped me get a sense of the overall notetaking &ldquo;enthusiast&rdquo; scene</a> and lent support to my theory that there is a core group of active users who are open to trying new apps.</li>\n<li>It helped me decide how to approach text formatting; whether to implement <a href=\"https://www.baldurbjarnason.com/2022/why-people-use-markdown/\">rich text or markdown</a>.</li>\n<li>It gave me the tools and context to outline <a href=\"https://www.baldurbjarnason.com/2022/the-different-kinds-of-notes/\">a categorisation of the various approaches to notetaking</a> and gave me the framework to more clearly define and describe the approach I&rsquo;m going to try out.</li>\n<li>It allowed me to test out a variety of static UI mockups to figure out the broad strokes of what worked and what didn&rsquo;t.</li>\n</ul>\n<p>Finally, writing these entries where I analyse and outline the observations from the interviews while explaining where they stand relative to my <em>other</em> research, helped me consolidate my ideas into a cohesive theory of how a subset of the notetaking field works.</p>\n<p>The research I&rsquo;ve done isn&rsquo;t enough to lend my theories scientific legitimacy (for that I&rsquo;d need way more money) but it&rsquo;s enough to give me confidence in going forward.</p>\n<p>My hunches:</p>\n<ul>\n<li>When it comes to notetaking, knowledge work (e.g. most kinds of office work that require expertise of some sort) has more in common with creative work than not and benefits from similar approaches.</li>\n<li>That most kinds of notetaking don&rsquo;t need complex organisational structures.</li>\n<li>That two-dimensional spaces (like a pinboard) are underused as organisational metaphors in creative software.</li>\n<li>That most of the usefulness of notetaking doesn&rsquo;t come from a system, organisation, or references but the <em>act of writing</em>.</li>\n<li>That, ultimately, the goal of the notetaking is to <em>make something for somebody else</em>.</li>\n</ul>\n<p>There are many kinds of notes, but these are the kinds of notes I&rsquo;m hoping to support. The app should help those in creative or knowledge work become better at their jobs.</p>\n<p>Most of these kinds of jobs involve other people.</p>\n<p>Couple that with the need for the high-quality examples required for mastery and the key to a great <em>personal</em> notetaking app is then, paradoxically, other people.</p>\n<h2 id=\"other-people-the-various-types-of-collaboration\">Other people (the various types of collaboration)</h2>\n<p>It can be jarring to listen to people describe the many ways they work with other people. Especially if you&rsquo;re only used to the limited takes on collaboration that are the norm in the software industry.</p>\n<p>Tech today favours only two approaches to collaborative work:</p>\n<ol>\n<li>Multiplayer spaces that are shared in real time (or close to real time).</li>\n<li>A library where everybody sees and contributes to the same shared space.</li>\n</ol>\n<p>Both are essentially the same idea: a space with realtime synchronisation and presence signalling; and a space without.</p>\n<p>Examples of the former include Google Docs, Slack, Figma, and Zoom. Their design makes you aware of everybody else in the space, and their actions affect your perception of that space in real time (or close to real time).</p>\n<p>Examples of the latter include Wikipedia, various kinds of knowledge bases, Dropbox and Google Drive, and version control systems. They are all about making it easy for a group of people to work simultaneously in a space but without realtime awareness of each others actions.</p>\n<p>The makers of both kinds of apps often invest a lot of engineering hours into making sure that multiple people can work on the same document or file at the same time without causing conflicts or losing data.</p>\n<p>Other approaches that used to have favour in tech but are now out of fashion, despite their evident popularity among end users:</p>\n<ul>\n<li>Forums and discussion groups. Arguably the world&rsquo;s favourite form of online collaboration, used for everything from coordinating the development of multi-million dollar software projects to a family picnic.</li>\n<li>Email: a federated messaging system where each user gets a personal data repository to manage shared data and messages.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Folksonomy\">Folksonomy or collaborative tagging</a>. Helps groups of people organise an ad hoc library of documents, web pages, or files.</li>\n</ul>\n<p>Most discussions of how to make collaborative software focus on one or more of these approaches.</p>\n<p>This is like describing a chair in terms of the hammers, saws, and screwdrivers used to make it. Great when talking to other carpenters who want to make another exactly like it. Not so great when you want to find out whether the chair works for sitting.</p>\n<p>We need to have a clear idea of what people are trying to accomplish with collaboration. Knowing the tools we can provide them with as UX designers is not enough.</p>\n<p>A non-exhaustive list of the primary goals of most collaborative office work:</p>\n<ul>\n<li>Consensus-building.</li>\n<li>Feedback and review.</li>\n<li>Knowledge sharing.</li>\n<li>Parallel work.</li>\n</ul>\n<h3 id=\"consensus-building\">Consensus-building</h3>\n<p>The point of most meetings, brainstorming sessions, and workplace discussions isn&rsquo;t to generate ideas, make decisions, or understand the situation. The point is to build consensus. The ideas or decisions are the most straightforward part of the process. Without consensus, they are all meaningless.</p>\n<p>Constructive examples from the interviews include:</p>\n<ul>\n<li>Meeting minutes in Google Docs or Hack.md to make sure that they reflect the group&rsquo;s consensus on what was said and decided.</li>\n<li>Plan of action proposals that needed to be approved by several people to happen.</li>\n</ul>\n<p>For consensus-building, you need everybody to have an overview of what everybody has said, who has participated, and what the overall argument has been.</p>\n<p>Any time you have a group of people together where everybody is aware of everybody else&rsquo;s presence and status, you tend to automatically end up with a group consensus, even if that wasn&rsquo;t what you wanted. We are a <a href=\"https://en.wikipedia.org/wiki/In-group_favoritism\">social species</a>, and we are really good at <a href=\"https://en.wikipedia.org/wiki/Bandwagon_effect\">adjusting our own opinions</a> to match that <a href=\"https://en.wikipedia.org/wiki/Communal_reinforcement\">of the crowd</a>.</p>\n<p>The Bandwagon Effect (and the equal and opposite anti-Bandwagon Effect) is what drives most online social interactions. It&rsquo;s what tore blogs apart; what makes Twitter a hellsite; and what turned Facebook into the propaganda machine it is today.</p>\n<p>It also tends to lead to bad outcomes in collaborative work.</p>\n<p>Consensus-building is an essential part of work collaboration but it can&rsquo;t be the <em>only</em> part. The dominance of consensus-building online collaboration tools directly leads to worse decisions.</p>\n<p>Here&rsquo;s <a href=\"https://headrush.typepad.com/creating_passionate_users/2005/03/one_of_us_iisi_.html\">Kathy Sierra again</a> talking about how this phenomenon is described in the book <em>The Wisdom of Crowds</em> (which, paradoxically, talks a lot about how crowds are dumb):</p>\n<blockquote>\n<p>And that&rsquo;s all great and intuitive&hellip; <em>until you get to humans.</em> Humans, he said, demonstrate the <em>opposite</em> principle: more interactions equals dumber behavior. When we come together and interact as a group seeking consensus, we <em>lose</em> sophistication and intelligence. Ants get smarter while we get dumber.</p>\n</blockquote>\n<p>And.</p>\n<blockquote>\n<p>At its simplest form, it means that if you take a bunch of people and ask them (as individuals) to answer a question, the average of each of those individual answers will likely be <em>better</em> than if the group works <em>together</em> to come up with a single answer.</p>\n</blockquote>\n<h3 id=\"feedback-and-review\">Feedback and review</h3>\n<p>Another common scenario is to get feedback or a review of an idea, proposal, or piece of work. You have a thing. You would like to improve said thing. So, you ask a bunch of people what they think, giving more weight to those with relevant expertise. It&rsquo;s a time-tested strategy.</p>\n<p>The pitfall here is that if the participants are aware of each other&rsquo;s contributions, they will almost always automatically switch to consensus-building instead of providing their honest feedback. Worst case scenario: the bandwagon effect gathers steam and drives you toward a crap decision.</p>\n<p>These kinds of disasters are a routine occurrence today. You see them in corporations, small and large, in movie studios, at publishing houses, and in governments. A product or project is released and all of a sudden you have a bunch of people in your inbox pointing out glaring, obvious, and fatal flaws that everybody involved had missed.</p>\n<p>To get the best feedback possible from the participants, you need to avoid the mechanisms of consensus-building. You need to ensure that everybody&rsquo;s responses are kept separate and only visible to those responsible for integrating all of the feedback, something that&rsquo;s surprisingly difficult to accomplish in modern collaborative software.</p>\n<p>The interviewees all had examples where they needed to get feedback from a specific person on something they did. But only those who were specifically writing or teaching as a part of their job did feedback in a structured way. Most of the examples of feedback or reviews that came up in the interviews were more accurately examples of <em>consensus building</em> as described above as they all involved:</p>\n<ul>\n<li>Groups of people.</li>\n<li>Who could see each other&rsquo;s work.</li>\n<li>And who debated until they all agreed.</li>\n</ul>\n<p>That&rsquo;s just the consensus trap all over again. Which is fine, if that&rsquo;s what you actually wanted, but counterproductive if needed that feedback.</p>\n<h3 id=\"knowledge-sharing\">Knowledge sharing</h3>\n<p>This is the one everybody loves to try to solve because it&rsquo;s a problem that everybody seems to have. The reasoning is straightforward and compelling:</p>\n<ul>\n<li>Most organisations have a lot of documents and data floating around that hardly ever gets revisited or used.</li>\n<li>They all have research, reading, and relevant information collecting dust.</li>\n</ul>\n<p>Stuff that should be informing the decisions and strategies of the company. Some of it sits unread in a knowledge base or a wiki. Some of it lies in the drives of individual employees who don&rsquo;t have a way to share it productively.</p>\n<p>So much knowledge not being applied!</p>\n<p>Except that&rsquo;s not how we work as human beings. If you haven&rsquo;t read it, experienced it, and contextualised it, then it isn&rsquo;t knowledge to you. Knowledge is a quality that people possess, not documents, and the only way to transfer it from one place to another is for people at both ends to apply themselves and make it their own.</p>\n<p>In terms of preserving and transmitting knowledge, most of the systems being used are working about as well as they ever can, and even if you could improve upon them, it&rsquo;s highly unlikely that anybody would pay you for that improvement as it&rsquo;s <a href=\"https://stackingthebricks.com/pizza-crust-problems/\">a pizza crust problem</a>, to use a phrase coined by Amy Hoy.</p>\n<p>Using the term &ldquo;knowledge&rdquo; for knowledge sharing and knowledge bases is misleading. It&rsquo;s the term of art, but it&rsquo;s also wrong enough to lead you to make poor decisions. We should be talking about documentation and references. In other words: a library. At scale, when you&rsquo;re dealing with a large collection of documents and papers, you&rsquo;re probably big enough to hire somebody (or a team of somebodies) with an information science degree (or degrees).</p>\n<p>If you&rsquo;re big enough to have a library where everything gets lost all the time but still too small to hire people who have the relevant expertise to solve the problem, you&rsquo;re kind of screwed. Search only works up to a point.</p>\n<p>Thankfully, if keep your scope limited (small organisation or single department) there&rsquo;s this neat thing that digital files can do that saves the day: <em>digital files can be in multiple places at the same time.</em></p>\n<p>The issue with large shared document libraries at most companies is:</p>\n<ol>\n<li>They generally don&rsquo;t have an organising principle beyond the personal tastes of the employee who volunteered to organise the Google Drive.</li>\n<li>If they <em>do</em> have an organising principle, it isn&rsquo;t understood by most of those who use it, which leads them to move things around and leave items in the wrong place.</li>\n<li>Almost every time somebody puts a document in a place that makes sense to <em>them</em>, it&rsquo;s lost to everybody else.</li>\n</ol>\n<p>Information science people <em>know</em> how to solve these problems and others that come up, but what if you don&rsquo;t have one of those hanging around?</p>\n<p>The simplest solution, one that works surprisingly often, is for everybody to maintain their organisation for the document library.</p>\n<p>To use the shelf analogy: if you have a large enough shared bookshelf and you move a book to a place that makes sense to you, then that book is immediately lost to those who knew where it was in the old place.</p>\n<p>If you, on the other hand, have a bookshelf for each employee and unlimited copies of all of the books, then each person can organise their version of the library in a way that they understand and can navigate easily.</p>\n<p>If you ever wondered why every office has at least one person who emails themselves everything&mdash;files, PDFs, pictures, whatever&mdash;now you know.</p>\n<p>This approach has obvious limitations. It&rsquo;s crap at helping you find stuff that came up before you started work in the organisation and it doesn&rsquo;t scale to a large organisation.</p>\n<p>A bookmarking service that supports collaborative tagging (folksonomies) can often fill in that gap.</p>\n<p>Doesn&rsquo;t always work. Even when it doesn&rsquo;t, it&rsquo;s probably still going to be better than the black hole of data that passes as your shared Google Drive or Dropbox.</p>\n<p>Almost everybody I interviewed described knowledge sharing as an ideal they aspired to but none of them practised it.</p>\n<h3 id=\"parallel-work\">Parallel work</h3>\n<p>Finally, we get to the other kind of collaboration that modern software is good at (the first being consensus-building, which apps and the web excel at, to a fault).</p>\n<p>Namely, working people down to the bone&mdash;I mean, helping people work in parallel.</p>\n<p>With Google Docs, you can get a group of writers to work in parallel on whichever part of the document you want. With Git, a group of developers can be working on separate problems in the same codebase without issue. With Figma, you can have all of your designers working on your design library at the same time and the app will handle it without a hiccup.</p>\n<p>This can be great and this can be awful. The great part is obvious: sometimes you can sic a bunch of people at a problem and they&rsquo;ll tear it apart. But also sometimes a problem can only be solved by a single person with expertise and others would only get in their way.</p>\n<p>The risk with these tools is that they are also frequently inadvertent consensus engines. Because tools like Google Docs and Figma show the work in a single shared space and make you aware of the actions and presence of others working in said space they end up having the same drive towards consensus as you get in UIs <em>specifically designed to help a group come to a consensus</em>.</p>\n<p><em>Amazing division of labour; mediocre outcomes.</em></p>\n<p>In <a href=\"https://headrush.typepad.com/creating_passionate_users/2005/02/the_power_of_on.html\">Kathy Sierra&rsquo;s words:</a></p>\n<blockquote>\n<p>I&rsquo;m not dissing teams&ndash;our books are all collaborative efforts, and far better because of it. And we consider ourselves to be on a team that includes our publisher O&rsquo;Reilly. It&rsquo;s not teams that are the problem, it&rsquo;s the rabid insistence on teamwork. Group think. Committee decisions.</p>\n<p>Most truly remarkable ideas did not come from teamwork. Most truly brave decisions were not made through teamwork. The team&rsquo;s role should be to act as a supportive environment for a collection of individuals. People with their own unique voice, ideas, thoughts, perspectives. A team should be there to encourage one another to pursue the wild ass ideas, not get in lock step to keep everything cheery and pleasant.</p>\n</blockquote>\n<p>Everybody I interviewed had experience with parallel work, thanks to Google Docs. They all mentioned having worked on a document or a spreadsheet in parallel with others as a part of their job. The developers all used GitHub as well.</p>\n<h2 id=\"putting-it-all-together\">Putting it all together</h2>\n<p>&mdash;<em>This sounds impossible! Might as well give up.</em></p>\n<p>It would be impossible if you tried to solve all of the problems I&rsquo;ve described with one app. Instead what the research helped me do is narrow down the focus of the app and validate or invalidate some of my assumptions.</p>\n<p>As I described in the <a href=\"https://www.baldurbjarnason.com/2022/why-people-use-markdown/\">first entry in this series</a>, heavy users in the notetaking scene are extraordinarily sensitive to lock-in and interoperability. While I&rsquo;m hesitant to base the app on markdown&mdash;I think the format is a major roadblock for many on the path to master writing and notetaking&mdash;I need to make sure the app offers similar interop and compatibility guarantees as you get from a plain text format.</p>\n<p>In <a href=\"https://www.baldurbjarnason.com/2022/the-different-kinds-of-notes/\">the second entry</a> I described the different kinds of notetaking people use. The research helped me decide that I wanted to focus on making a notetaking app for structured creative work, operating on the assumption that <em>knowledge work</em> has more in common with creative work than not. I also reviewed some of the different ways experienced writers commonly structure their notes and research, focusing on two that I called The Box and The Map.</p>\n<p>And in this entry, I&rsquo;ve been describing how practice and feedback are a vital part of helping people develop skills and expertise.</p>\n<p>Through this work I&rsquo;ve been finessing the concept of the app and cutting it down to four main spaces or views, each with a specific purpose, all connected through feedback loops.</p>\n<ol>\n<li>The Journal</li>\n<li>The Dot Grid</li>\n<li>The Reading Corner</li>\n<li>The Sharing Space</li>\n</ol>\n<p><em>The Journal</em> is your entry point. It ties everything together and prompts you to describe or contextualise the notes and bookmarks that you&rsquo;ve added, edited, or deleted that day. As I described in my last entry, almost every book on writing or creative work strongly recommends a daily, goalless journal. It needs to be daily (or close to daily) because it&rsquo;s practice. It needs to be goalless because it&rsquo;s <em>deliberate</em> practice. You aren&rsquo;t writing it to meet a deadline or finish a project. It&rsquo;s there for you to empty your head, so to speak.</p>\n<p><em>The Dot Grid</em> is The Box. It&rsquo;s the semi-structured space you use to collect your things.</p>\n<p>Roy Peter Clark uses literal boxes, one for each project, and describes the process in his book <em>Writing Tools</em> in terms of saving string in a box:</p>\n<blockquote>\n<p>To save string, I need a simple file box. I prefer the plastic ones that look like milk crates. I display the box in my office and put a label on it, say &ldquo;The Plight of Boys.&rdquo; As soon as I declare my interest in an important topic, a number of things happen. I notice more things about my topic. Then I have conversations about it with my friends and colleagues. They feed my interest. One by one, my box fills with items: an analysis of graduation rates of boys versus girls; a feature on whether video games help or hinder the development of boys; a story about decreasing participation by boys in high school sports. This is a big topic, so I take my time. Weeks and weeks pass, sometimes months and months, and one day I&rsquo;ll look over at my box and hear it whisper, &ldquo;It&rsquo;s time.&rdquo; I&rsquo;m amazed at its fullness, and even more astonished at how much I&rsquo;ve learned just by saving string. (p. 215)</p>\n</blockquote>\n<p><em>The Reading Corner</em> is where you read and review both the articles you&rsquo;ve bookmarked and your own notes. It&rsquo;s important when reviewing other people&rsquo;s writing and your own that both happen in an identical environment. In theory, it should strengthen your perceptual knowledge to edit your writing in the same space as you read the (presumably) high-quality research that you&rsquo;ve collected.</p>\n<p>Finally, <em>The Sharing Space</em> is the same as The Reading Corner except it&rsquo;s specifically for getting feedback from other people. You should be able to take a note or a draft and get independent feedback from each of your reviewers.</p>\n<p>That&rsquo;s the theory and the concept. This is what I hope Colophon Cards will be.</p>\n<hr>\n<h2 id=\"our-obligation-as-makers-of-software-as-explained-by-the-collapse-of-the-blogosphere\">Our obligation as makers of software, as explained by the collapse of the blogosphere</h2>\n<p>In early 2007, a small group of popular bloggers started a site called <em>Mean Kids</em>, a tongue in cheek reference to some of the participants having previously been likened to &ldquo;the mean kids in high school&rdquo;. It claimed to be satire that poked fun at some of the people in the blogging world that annoyed them. That included Kathy Sierra (among others, it was a really mean-spirited effort).</p>\n<p>The problem with the <a href=\"https://en.wikipedia.org/wiki/Bandwagon_effect\">Bandwagon Effect</a> and the anti-Bandwagon Effect online is that it leads to escalation. Everything keeps escalating unless you specifically take measures to prevent it, right at the beginning, which this group didn&rsquo;t (out of ideological opposition to content moderation) until it was too late. The tech industry is filled with well-meaning enablers of abuse and 2007 wasn&rsquo;t any different.</p>\n<p>These events were well documented at the time. <a href=\"https://reagle.org/joseph/pelican/social/sierra-takes-techcrunch-to-task.html\">This take, by Joseph Reagle</a>, is as good as any.</p>\n<p>The man who escalated the furthest was Andrew &ldquo;Weev&rdquo; Auernheimer who has since confessed several times to not only spreading lies about Kathy Sierra but also publishing her home address and social security number, encouraging people to send her &lsquo;presents&rsquo; that showed what they thought of her.</p>\n<p>And they did. Some of them were death threats.</p>\n<p>So, Kathy stopped speaking publicly and stopped blogging. She retreated from the public web while Weev rose to stardom as a &lsquo;hacktivist&rsquo;. Many people in tech adored him for fighting against unfair laws that &lsquo;stifled&rsquo; progress in the industry.</p>\n<p>This is when I lost faith in blogs and online social media. This dynamic, repeated endlessly since then, is why distributed social media like the &lsquo;blogosphere&rsquo; collapses; why Twitter is a hellsite; why Facebook is the place that turns Granddad into a nazi; why federated social media like Mastodon breaks apart into smaller isolated clusters.</p>\n<p>The tech industry either doesn&rsquo;t understand the harm being done by their idea of how social interactions work or it doesn&rsquo;t care.</p>\n<p>More than any other, this is the event that made me a sceptic of the promises of progress that the software industry is fond of making. It hammered home the obligation the rest of us have, those who <em>do</em> care, in making sure that the software and technology that <em>we</em> work on don&rsquo;t enable the kinds of abuse and harm that keeps happening with mainstream social and collaborative media.</p>\n<p>No app I make or work on should prioritise collaboration and work over the well-being of others. The obscurity or lack of popularity of my software or yours should not be the only thing that prevents it from being used for abuse.</p>\n<hr>\n<p>Kathy Sierra returned to social media and the public web in 2013, joining Twitter as <code>seriouspony</code> and launching a website to promote <a href=\"http://seriouspony.com/badass-users-the-book\">her upcoming book</a>.</p>\n<p>For a while it seemed to be going well. The book, after all, is amazing. I highly recommend it. But then the crap kept coming. People kept repeating the lies Weev had told about her. He kept being heralded as a hacktivist and an important man in the fight against government overreach. Every time she tried to push back against the lies, <em>she</em> ended up being the one accused of being a troll.</p>\n<p>The tech industry <em>loves</em> its abusive dudes.</p>\n<p>So, she decided to stop. Only a few months after her return, she wrote a post explaining why, republished by Wired as <a href=\"https://www.wired.com/2014/10/trolls-will-always-win/\"><em>Why the Trolls Will Always Win</em></a>:</p>\n<blockquote>\n<p>I don’t have the luxury of assuming “it’s just online. Not REAL. It&rsquo;s not like these people would ever do anything in the real world.” And what you don’t hear much about is what most targeted women find the most frightening of all: the stalkerish energy, time, effort, focus on… YOU. The drive-by hate/threat comment, no matter how vile, is just that, a comment that took someone 2.5 seconds to think and execute. It might be annoying, offensive, maybe intimidating the first few times. But you get used to those, after all, it’s not like somebody put time and effort into it.</p>\n<p>But Photoshopped images? Stories drawn from your own work? There’s a creepy and invasive horror knowing someone is pouring over your words, doing Google and Flickr image searches to find the perfect photo to manipulate. That someone is using their time and talent to write code even, about you. That’s not trolling, that’s obsession. That’s the point where you know it’s not really even about the Koolaid now…they’re obsessed with you.</p>\n<p>This is a very long way from the favorite troll talking point “Oh boohoo someone was mean on the internet.”</p>\n</blockquote>\n<p>Being online wasn&rsquo;t worth the risk, so she left.</p>\n<p>Since then Weev came out as a Nazi, got himself a swastika tattoo, and more than once has excused or advocated for mass murder while maintaining one of the more prominent online neo-nazi communities.</p>\n<p>Despite this, I haven&rsquo;t seen a single person who took his side over Kathy Sierra&rsquo;s recant and apologise. Many instead doubled down, saying that in principle they were correct to defend a nazi&rsquo;s freedom of speech.</p>\n<p>At most, when you press them, you get a vague apology about how in nerd circles you have to have a tolerance for strange politics. Which is why it was apparently impossible for them to register what sort of person Weev was until it was too late.</p>\n<p>It should worry you that these people, and others with similar priorities and similarly poor judgement, are still so influential in the tech industry.</p>\n<p>And the rest of us need to try to be better.</p>\n<h2 id=\"the-next-steps-for-colophon-cards\">The next steps for Colophon Cards</h2>\n<p>Next, it&rsquo;s time to start implementing the prototype proper and start testing actual designs.</p>\n<hr>\n<p>The Colophon Cards project is made possible by a grant from <a href=\"https://en.rannis.is/funding/research/technology-development-fund/nr/545\">The Icelandic Centre for Research&rsquo;s Technology Development Fund</a></p>",
      "content_text": "\nMy reading corner.\n\n\nThis post is the final entry of three in a series where I go over what I learned from the user research I’ve been doing for Colophon Cards. The first was about markdown. The second was about the various different kinds of notetaking.\nIt all began with blogging\nAs I’ve mentioned earlier in this series, I’ve been blogging for almost two decades. What I didn’t mention was that I was a true believer in ‘Blogging’.\n—So, you believed in having a personal website, what of it?\nNo, you see, at the time blogging was supposed to be so much more than that. I truly believed that it heralded the future of collaboration, communications, publishing, and intellectual discourse. I believed that the future of social media was an interconnected web of personal blogs. I believed that the future of intellectual discourse was in cross-blog debates on lofty topics.\nI believed the hype. I was quite wrong.\nBlogs didn’t quite die. You could even say that they won as they have become a cornerstone of the web’s infrastructure:\n\n40% of the web runs on WordPress, which is blog software.\nSubstack and similar newsletter platforms offer a reverse-chronological list of posts and an RSS feed and are basically rebranded blogs.\nPodcasts are blogging with audio files.\nThe affordances invented by blogs are everywhere. Many news sites maintain ongoing daily liveblogs on specific events, such as COVID-19 or the UK’s political scandal of the day. They may not call it a liveblog, but that’s what they are.\nMuch of the web’s automation is built on feed data that’s shuffled from service to service. Feeds are the quintessential blog tech.\nBlogs transformed how we approach content management systems (CMSes), even when those CMSes don’t use any blog-related design affordances.\nYoutuber video essays are an evolution of early attempts at “video blogging” or video-based podcasting.\n\nBlog tech underpins almost everything you see online.\nSo, while blogs didn’t quite have the profound effect on society, publishing, and media that I expected them to have, their influence is respectable and far-reaching.\nI am biased in favour of blogs, though. They had a major influence on my intellectual development, to the point where I still to this day revisit old blog post favourites for fresh inspiration.\nOne such major influence, one that probably changed my entire outlook on both writing and software development, was Kathy Sierra and her blog Creating Passionate Users. Her writing sent me down a path of studying the learning process, skills development, expertise, mastery, and why they matter to software development and UI design.\nAnd Kathy Sierra’s social media story—that began with a group of self-styled ‘mean kids’ revelling in mean jokes and ended with literal nazis calling for mass murder—is the reason why I fell out of love with weblogs and began to distrust the tech industry’s approach to social media and online collaboration.\n\nGetting back to notetaking, or the one where I piss off the punditry (again)\nI reject the ‘external brain’ hypothesis for notetaking.\nOr, more specifically, I think it’s a counterproductive metaphor for notetaking.\nThe hypothesis is straightforward: a complex notetaking system, built in the form of a structured web, acts as an extension of your brain and makes you smarter.\nThe theory is sometimes stated; sometimes merely implied. But it’s the trend among those making notetaking apps or selling courses on notetaking to talk as if structured, interlinked notetaking will raise your IQ, help you think more clearly, and prompt a wellspring of new ideas. Your collection of notes, dutifully linked and tagged, woven into an impenetrable fabric of collections and context, are therefore serious work and the promise is that all of that effort will be rewarded with intelligence, memory, and genius. The notetaking system is complex and tough to use because it’s supposed to expand the cognitive space that we use to structure our thoughts and generate ideas.\nThe problem is that even if our observations about these notetaking systems are correct, we don’t know if we have the arrow of causality pointing in the right direction.\nMaybe that German academic was a genius and he definitely used a complex notetaking system. But was he a genius because he had a complex and involved notetaking system? Or did a complex and involved system work for him because he was a genius?\nIs it the notetaking system that’s helping you think more clearly? Or is it the act of writing that forces you to clarify your thoughts?\nIs it the complex interlinked web of notes that helps you get new ideas? Or is it all the reading you’re doing to fill that notetaking app bucket?\nIs all of this notetaking work making you smarter? Or is it just indirectly forcing you into deliberate, goalless practice?\nIf the external brain hypothesis is correct, then complexity is essential. You can’t have a neurological extension of the brain without neurological complexity. The involved structures and regimented processes exist to tap into specific structures in our brain. There might be variations but all should have a baseline complexity that can’t be abstracted away because, hey, the brain is complex.\nThat’s the theory, at least.\nHowever, if my suspicions are correct, then the primary benefit from notetaking comes from regular, deliberate practice. It doesn’t matter if you’re sketching, journaling, collaging, jotting down bullet points, recording a daily video, or just writing. It doesn’t matter if you’re filing it all away with a detailed ontology into a structured database or if you’re dumping it all into a box. It’s the habitual practice—in a way that fits your skill, personality, and practices—that matters.\nIf I’m right, then you can get the results of a complex notetaking system with a lot less work. Or, to be more specific, with a lot less wasted work—it should all go into the writing (or sketching, recording, etc.).\nThe key is that the object of notetaking is never to take notes. It’s to do a better job:\n\nBuild better software.\nWrite better blog posts or finally finish that novel.\nRenovate that spare bedroom into something nice.\nBecome more thoughtful about what you buy and eat.\nWrite a better thesis.\nMake better art.\nTake better photographs.\n\nNotetaking should always be less work than the actual work you’re doing. When the notetaking process takes over, something has gone seriously wrong.\n\nHow blogs influenced my thinking on the subject\nKathy Sierra’s work has a single recurring idea from the very beginning of her first blog, Creating Passionate Users to her amazing 2015 book Badass: Making Users Awesome: the job of the tools we make is to set the user on a path of mastery. The tool shouldn’t get in the way of them improving their skills. It shouldn’t overload the UI with distractions. It should enable experimentation and practice. It should be designed in such a way as to enable and foster mastery.\nThat requires us to understand what mastery and skills development is, how it comes from deliberate goalless practice, exposure to examples of work that exhibit the skills the user aspires to, from having a tight feedback loop that lets the end user be aware of how they are working when they need to, from increasing the resolution of the work when applicable. And the generally accepted key to mastery (or skill-specific expertise, if you want to be nitpicky), is twofold: deliberate practice and perceptual knowledge.\nIn Kathy Sierra’s words, from her book Badass, first on practice:\n\nPracticing harder and longer can potentially make us even worse than if we did less practicing.\nBuilding deep expertise takes work, but of a very specific type that’s often the opposite of what people do when practicing.\nPractice does not make perfect\n\nOn perceptual knowledge:\n\nThe second attribute of those who became experts is this: they were exposed to high quantity, high quality examples of expertise. (page 128)\n\n\nAfter enough exposure with feedback, your brain began detecting patterns and underlying structures, without your conscious awareness. With more exposure, your brain fine-tuned its perception and eventually figured out what really mattered. Your brain was making finer distinctions and sorting signal from noise even if you couldn’t explain how. (page 133)\n\nThese two ideas, deliberate practice and exposure to high-quality examples, should be the forces that drive the design and structure of most apps. That includes Colophon Cards.\n\nThe research so far\nAs I wrote in my last entry, I began my research into writing and notetaking well before I began the Colophon Cards project itself. I came to the project with a set of ideas. I’d based them on my research of existing studies and writing about expertise, mastery, creative work, and knowledge work. (And I reviewed a ton of forum threads on notetaking.)\nThe purpose of the survey and the interviews was to see if I could validate or invalidate some of my guesses before I advance to the implementation stage proper. Better now than after I’ve implemented something.\n\nThe survey helped me get a sense of the overall notetaking “enthusiast” scene and lent support to my theory that there is a core group of active users who are open to trying new apps.\nIt helped me decide how to approach text formatting; whether to implement rich text or markdown.\nIt gave me the tools and context to outline a categorisation of the various approaches to notetaking and gave me the framework to more clearly define and describe the approach I’m going to try out.\nIt allowed me to test out a variety of static UI mockups to figure out the broad strokes of what worked and what didn’t.\n\nFinally, writing these entries where I analyse and outline the observations from the interviews while explaining where they stand relative to my other research, helped me consolidate my ideas into a cohesive theory of how a subset of the notetaking field works.\nThe research I’ve done isn’t enough to lend my theories scientific legitimacy (for that I’d need way more money) but it’s enough to give me confidence in going forward.\nMy hunches:\n\nWhen it comes to notetaking, knowledge work (e.g. most kinds of office work that require expertise of some sort) has more in common with creative work than not and benefits from similar approaches.\nThat most kinds of notetaking don’t need complex organisational structures.\nThat two-dimensional spaces (like a pinboard) are underused as organisational metaphors in creative software.\nThat most of the usefulness of notetaking doesn’t come from a system, organisation, or references but the act of writing.\nThat, ultimately, the goal of the notetaking is to make something for somebody else.\n\nThere are many kinds of notes, but these are the kinds of notes I’m hoping to support. The app should help those in creative or knowledge work become better at their jobs.\nMost of these kinds of jobs involve other people.\nCouple that with the need for the high-quality examples required for mastery and the key to a great personal notetaking app is then, paradoxically, other people.\nOther people (the various types of collaboration)\nIt can be jarring to listen to people describe the many ways they work with other people. Especially if you’re only used to the limited takes on collaboration that are the norm in the software industry.\nTech today favours only two approaches to collaborative work:\n\nMultiplayer spaces that are shared in real time (or close to real time).\nA library where everybody sees and contributes to the same shared space.\n\nBoth are essentially the same idea: a space with realtime synchronisation and presence signalling; and a space without.\nExamples of the former include Google Docs, Slack, Figma, and Zoom. Their design makes you aware of everybody else in the space, and their actions affect your perception of that space in real time (or close to real time).\nExamples of the latter include Wikipedia, various kinds of knowledge bases, Dropbox and Google Drive, and version control systems. They are all about making it easy for a group of people to work simultaneously in a space but without realtime awareness of each others actions.\nThe makers of both kinds of apps often invest a lot of engineering hours into making sure that multiple people can work on the same document or file at the same time without causing conflicts or losing data.\nOther approaches that used to have favour in tech but are now out of fashion, despite their evident popularity among end users:\n\nForums and discussion groups. Arguably the world’s favourite form of online collaboration, used for everything from coordinating the development of multi-million dollar software projects to a family picnic.\nEmail: a federated messaging system where each user gets a personal data repository to manage shared data and messages.\nFolksonomy or collaborative tagging. Helps groups of people organise an ad hoc library of documents, web pages, or files.\n\nMost discussions of how to make collaborative software focus on one or more of these approaches.\nThis is like describing a chair in terms of the hammers, saws, and screwdrivers used to make it. Great when talking to other carpenters who want to make another exactly like it. Not so great when you want to find out whether the chair works for sitting.\nWe need to have a clear idea of what people are trying to accomplish with collaboration. Knowing the tools we can provide them with as UX designers is not enough.\nA non-exhaustive list of the primary goals of most collaborative office work:\n\nConsensus-building.\nFeedback and review.\nKnowledge sharing.\nParallel work.\n\nConsensus-building\nThe point of most meetings, brainstorming sessions, and workplace discussions isn’t to generate ideas, make decisions, or understand the situation. The point is to build consensus. The ideas or decisions are the most straightforward part of the process. Without consensus, they are all meaningless.\nConstructive examples from the interviews include:\n\nMeeting minutes in Google Docs or Hack.md to make sure that they reflect the group’s consensus on what was said and decided.\nPlan of action proposals that needed to be approved by several people to happen.\n\nFor consensus-building, you need everybody to have an overview of what everybody has said, who has participated, and what the overall argument has been.\nAny time you have a group of people together where everybody is aware of everybody else’s presence and status, you tend to automatically end up with a group consensus, even if that wasn’t what you wanted. We are a social species, and we are really good at adjusting our own opinions to match that of the crowd.\nThe Bandwagon Effect (and the equal and opposite anti-Bandwagon Effect) is what drives most online social interactions. It’s what tore blogs apart; what makes Twitter a hellsite; and what turned Facebook into the propaganda machine it is today.\nIt also tends to lead to bad outcomes in collaborative work.\nConsensus-building is an essential part of work collaboration but it can’t be the only part. The dominance of consensus-building online collaboration tools directly leads to worse decisions.\nHere’s Kathy Sierra again talking about how this phenomenon is described in the book The Wisdom of Crowds (which, paradoxically, talks a lot about how crowds are dumb):\n\nAnd that’s all great and intuitive… until you get to humans. Humans, he said, demonstrate the opposite principle: more interactions equals dumber behavior. When we come together and interact as a group seeking consensus, we lose sophistication and intelligence. Ants get smarter while we get dumber.\n\nAnd.\n\nAt its simplest form, it means that if you take a bunch of people and ask them (as individuals) to answer a question, the average of each of those individual answers will likely be better than if the group works together to come up with a single answer.\n\nFeedback and review\nAnother common scenario is to get feedback or a review of an idea, proposal, or piece of work. You have a thing. You would like to improve said thing. So, you ask a bunch of people what they think, giving more weight to those with relevant expertise. It’s a time-tested strategy.\nThe pitfall here is that if the participants are aware of each other’s contributions, they will almost always automatically switch to consensus-building instead of providing their honest feedback. Worst case scenario: the bandwagon effect gathers steam and drives you toward a crap decision.\nThese kinds of disasters are a routine occurrence today. You see them in corporations, small and large, in movie studios, at publishing houses, and in governments. A product or project is released and all of a sudden you have a bunch of people in your inbox pointing out glaring, obvious, and fatal flaws that everybody involved had missed.\nTo get the best feedback possible from the participants, you need to avoid the mechanisms of consensus-building. You need to ensure that everybody’s responses are kept separate and only visible to those responsible for integrating all of the feedback, something that’s surprisingly difficult to accomplish in modern collaborative software.\nThe interviewees all had examples where they needed to get feedback from a specific person on something they did. But only those who were specifically writing or teaching as a part of their job did feedback in a structured way. Most of the examples of feedback or reviews that came up in the interviews were more accurately examples of consensus building as described above as they all involved:\n\nGroups of people.\nWho could see each other’s work.\nAnd who debated until they all agreed.\n\nThat’s just the consensus trap all over again. Which is fine, if that’s what you actually wanted, but counterproductive if needed that feedback.\nKnowledge sharing\nThis is the one everybody loves to try to solve because it’s a problem that everybody seems to have. The reasoning is straightforward and compelling:\n\nMost organisations have a lot of documents and data floating around that hardly ever gets revisited or used.\nThey all have research, reading, and relevant information collecting dust.\n\nStuff that should be informing the decisions and strategies of the company. Some of it sits unread in a knowledge base or a wiki. Some of it lies in the drives of individual employees who don’t have a way to share it productively.\nSo much knowledge not being applied!\nExcept that’s not how we work as human beings. If you haven’t read it, experienced it, and contextualised it, then it isn’t knowledge to you. Knowledge is a quality that people possess, not documents, and the only way to transfer it from one place to another is for people at both ends to apply themselves and make it their own.\nIn terms of preserving and transmitting knowledge, most of the systems being used are working about as well as they ever can, and even if you could improve upon them, it’s highly unlikely that anybody would pay you for that improvement as it’s a pizza crust problem, to use a phrase coined by Amy Hoy.\nUsing the term “knowledge” for knowledge sharing and knowledge bases is misleading. It’s the term of art, but it’s also wrong enough to lead you to make poor decisions. We should be talking about documentation and references. In other words: a library. At scale, when you’re dealing with a large collection of documents and papers, you’re probably big enough to hire somebody (or a team of somebodies) with an information science degree (or degrees).\nIf you’re big enough to have a library where everything gets lost all the time but still too small to hire people who have the relevant expertise to solve the problem, you’re kind of screwed. Search only works up to a point.\nThankfully, if keep your scope limited (small organisation or single department) there’s this neat thing that digital files can do that saves the day: digital files can be in multiple places at the same time.\nThe issue with large shared document libraries at most companies is:\n\nThey generally don’t have an organising principle beyond the personal tastes of the employee who volunteered to organise the Google Drive.\nIf they do have an organising principle, it isn’t understood by most of those who use it, which leads them to move things around and leave items in the wrong place.\nAlmost every time somebody puts a document in a place that makes sense to them, it’s lost to everybody else.\n\nInformation science people know how to solve these problems and others that come up, but what if you don’t have one of those hanging around?\nThe simplest solution, one that works surprisingly often, is for everybody to maintain their organisation for the document library.\nTo use the shelf analogy: if you have a large enough shared bookshelf and you move a book to a place that makes sense to you, then that book is immediately lost to those who knew where it was in the old place.\nIf you, on the other hand, have a bookshelf for each employee and unlimited copies of all of the books, then each person can organise their version of the library in a way that they understand and can navigate easily.\nIf you ever wondered why every office has at least one person who emails themselves everything—files, PDFs, pictures, whatever—now you know.\nThis approach has obvious limitations. It’s crap at helping you find stuff that came up before you started work in the organisation and it doesn’t scale to a large organisation.\nA bookmarking service that supports collaborative tagging (folksonomies) can often fill in that gap.\nDoesn’t always work. Even when it doesn’t, it’s probably still going to be better than the black hole of data that passes as your shared Google Drive or Dropbox.\nAlmost everybody I interviewed described knowledge sharing as an ideal they aspired to but none of them practised it.\nParallel work\nFinally, we get to the other kind of collaboration that modern software is good at (the first being consensus-building, which apps and the web excel at, to a fault).\nNamely, working people down to the bone—I mean, helping people work in parallel.\nWith Google Docs, you can get a group of writers to work in parallel on whichever part of the document you want. With Git, a group of developers can be working on separate problems in the same codebase without issue. With Figma, you can have all of your designers working on your design library at the same time and the app will handle it without a hiccup.\nThis can be great and this can be awful. The great part is obvious: sometimes you can sic a bunch of people at a problem and they’ll tear it apart. But also sometimes a problem can only be solved by a single person with expertise and others would only get in their way.\nThe risk with these tools is that they are also frequently inadvertent consensus engines. Because tools like Google Docs and Figma show the work in a single shared space and make you aware of the actions and presence of others working in said space they end up having the same drive towards consensus as you get in UIs specifically designed to help a group come to a consensus.\nAmazing division of labour; mediocre outcomes.\nIn Kathy Sierra’s words:\n\nI’m not dissing teams–our books are all collaborative efforts, and far better because of it. And we consider ourselves to be on a team that includes our publisher O’Reilly. It’s not teams that are the problem, it’s the rabid insistence on teamwork. Group think. Committee decisions.\nMost truly remarkable ideas did not come from teamwork. Most truly brave decisions were not made through teamwork. The team’s role should be to act as a supportive environment for a collection of individuals. People with their own unique voice, ideas, thoughts, perspectives. A team should be there to encourage one another to pursue the wild ass ideas, not get in lock step to keep everything cheery and pleasant.\n\nEverybody I interviewed had experience with parallel work, thanks to Google Docs. They all mentioned having worked on a document or a spreadsheet in parallel with others as a part of their job. The developers all used GitHub as well.\nPutting it all together\n—This sounds impossible! Might as well give up.\nIt would be impossible if you tried to solve all of the problems I’ve described with one app. Instead what the research helped me do is narrow down the focus of the app and validate or invalidate some of my assumptions.\nAs I described in the first entry in this series, heavy users in the notetaking scene are extraordinarily sensitive to lock-in and interoperability. While I’m hesitant to base the app on markdown—I think the format is a major roadblock for many on the path to master writing and notetaking—I need to make sure the app offers similar interop and compatibility guarantees as you get from a plain text format.\nIn the second entry I described the different kinds of notetaking people use. The research helped me decide that I wanted to focus on making a notetaking app for structured creative work, operating on the assumption that knowledge work has more in common with creative work than not. I also reviewed some of the different ways experienced writers commonly structure their notes and research, focusing on two that I called The Box and The Map.\nAnd in this entry, I’ve been describing how practice and feedback are a vital part of helping people develop skills and expertise.\nThrough this work I’ve been finessing the concept of the app and cutting it down to four main spaces or views, each with a specific purpose, all connected through feedback loops.\n\nThe Journal\nThe Dot Grid\nThe Reading Corner\nThe Sharing Space\n\nThe Journal is your entry point. It ties everything together and prompts you to describe or contextualise the notes and bookmarks that you’ve added, edited, or deleted that day. As I described in my last entry, almost every book on writing or creative work strongly recommends a daily, goalless journal. It needs to be daily (or close to daily) because it’s practice. It needs to be goalless because it’s deliberate practice. You aren’t writing it to meet a deadline or finish a project. It’s there for you to empty your head, so to speak.\nThe Dot Grid is The Box. It’s the semi-structured space you use to collect your things.\nRoy Peter Clark uses literal boxes, one for each project, and describes the process in his book Writing Tools in terms of saving string in a box:\n\nTo save string, I need a simple file box. I prefer the plastic ones that look like milk crates. I display the box in my office and put a label on it, say “The Plight of Boys.” As soon as I declare my interest in an important topic, a number of things happen. I notice more things about my topic. Then I have conversations about it with my friends and colleagues. They feed my interest. One by one, my box fills with items: an analysis of graduation rates of boys versus girls; a feature on whether video games help or hinder the development of boys; a story about decreasing participation by boys in high school sports. This is a big topic, so I take my time. Weeks and weeks pass, sometimes months and months, and one day I’ll look over at my box and hear it whisper, “It’s time.” I’m amazed at its fullness, and even more astonished at how much I’ve learned just by saving string. (p. 215)\n\nThe Reading Corner is where you read and review both the articles you’ve bookmarked and your own notes. It’s important when reviewing other people’s writing and your own that both happen in an identical environment. In theory, it should strengthen your perceptual knowledge to edit your writing in the same space as you read the (presumably) high-quality research that you’ve collected.\nFinally, The Sharing Space is the same as The Reading Corner except it’s specifically for getting feedback from other people. You should be able to take a note or a draft and get independent feedback from each of your reviewers.\nThat’s the theory and the concept. This is what I hope Colophon Cards will be.\n\nOur obligation as makers of software, as explained by the collapse of the blogosphere\nIn early 2007, a small group of popular bloggers started a site called Mean Kids, a tongue in cheek reference to some of the participants having previously been likened to “the mean kids in high school”. It claimed to be satire that poked fun at some of the people in the blogging world that annoyed them. That included Kathy Sierra (among others, it was a really mean-spirited effort).\nThe problem with the Bandwagon Effect and the anti-Bandwagon Effect online is that it leads to escalation. Everything keeps escalating unless you specifically take measures to prevent it, right at the beginning, which this group didn’t (out of ideological opposition to content moderation) until it was too late. The tech industry is filled with well-meaning enablers of abuse and 2007 wasn’t any different.\nThese events were well documented at the time. This take, by Joseph Reagle, is as good as any.\nThe man who escalated the furthest was Andrew “Weev” Auernheimer who has since confessed several times to not only spreading lies about Kathy Sierra but also publishing her home address and social security number, encouraging people to send her ‘presents’ that showed what they thought of her.\nAnd they did. Some of them were death threats.\nSo, Kathy stopped speaking publicly and stopped blogging. She retreated from the public web while Weev rose to stardom as a ‘hacktivist’. Many people in tech adored him for fighting against unfair laws that ‘stifled’ progress in the industry.\nThis is when I lost faith in blogs and online social media. This dynamic, repeated endlessly since then, is why distributed social media like the ‘blogosphere’ collapses; why Twitter is a hellsite; why Facebook is the place that turns Granddad into a nazi; why federated social media like Mastodon breaks apart into smaller isolated clusters.\nThe tech industry either doesn’t understand the harm being done by their idea of how social interactions work or it doesn’t care.\nMore than any other, this is the event that made me a sceptic of the promises of progress that the software industry is fond of making. It hammered home the obligation the rest of us have, those who do care, in making sure that the software and technology that we work on don’t enable the kinds of abuse and harm that keeps happening with mainstream social and collaborative media.\nNo app I make or work on should prioritise collaboration and work over the well-being of others. The obscurity or lack of popularity of my software or yours should not be the only thing that prevents it from being used for abuse.\n\nKathy Sierra returned to social media and the public web in 2013, joining Twitter as seriouspony and launching a website to promote her upcoming book.\nFor a while it seemed to be going well. The book, after all, is amazing. I highly recommend it. But then the crap kept coming. People kept repeating the lies Weev had told about her. He kept being heralded as a hacktivist and an important man in the fight against government overreach. Every time she tried to push back against the lies, she ended up being the one accused of being a troll.\nThe tech industry loves its abusive dudes.\nSo, she decided to stop. Only a few months after her return, she wrote a post explaining why, republished by Wired as Why the Trolls Will Always Win:\n\nI don’t have the luxury of assuming “it’s just online. Not REAL. It’s not like these people would ever do anything in the real world.” And what you don’t hear much about is what most targeted women find the most frightening of all: the stalkerish energy, time, effort, focus on… YOU. The drive-by hate/threat comment, no matter how vile, is just that, a comment that took someone 2.5 seconds to think and execute. It might be annoying, offensive, maybe intimidating the first few times. But you get used to those, after all, it’s not like somebody put time and effort into it.\nBut Photoshopped images? Stories drawn from your own work? There’s a creepy and invasive horror knowing someone is pouring over your words, doing Google and Flickr image searches to find the perfect photo to manipulate. That someone is using their time and talent to write code even, about you. That’s not trolling, that’s obsession. That’s the point where you know it’s not really even about the Koolaid now…they’re obsessed with you.\nThis is a very long way from the favorite troll talking point “Oh boohoo someone was mean on the internet.”\n\nBeing online wasn’t worth the risk, so she left.\nSince then Weev came out as a Nazi, got himself a swastika tattoo, and more than once has excused or advocated for mass murder while maintaining one of the more prominent online neo-nazi communities.\nDespite this, I haven’t seen a single person who took his side over Kathy Sierra’s recant and apologise. Many instead doubled down, saying that in principle they were correct to defend a nazi’s freedom of speech.\nAt most, when you press them, you get a vague apology about how in nerd circles you have to have a tolerance for strange politics. Which is why it was apparently impossible for them to register what sort of person Weev was until it was too late.\nIt should worry you that these people, and others with similar priorities and similarly poor judgement, are still so influential in the tech industry.\nAnd the rest of us need to try to be better.\nThe next steps for Colophon Cards\nNext, it’s time to start implementing the prototype proper and start testing actual designs.\n\nThe Colophon Cards project is made possible by a grant from The Icelandic Centre for Research’s Technology Development Fund",
      "date_published": "2022-06-02T12:56:06.000Z",
      "date_modified": "2022-06-02T12:56:06.000Z"
    },
    {
      "id": "https://www.baldurbjarnason.com/archive/",
      "url": "https://www.baldurbjarnason.com/archive/",
      "title": "On online collaboration and our obligations as makers of software",
      "content_html": "",
      "content_text": "",
      "date_published": "2022-06-02T12:56:06.000Z",
      "date_modified": "2022-06-02T12:56:06.000Z"
    },
    {
      "id": "https://www.baldurbjarnason.com/2022/the-different-kinds-of-notes/",
      "url": "https://www.baldurbjarnason.com/2022/the-different-kinds-of-notes/",
      "title": "The different kinds of notes",
      "summary": "This is the second entry of three where I go over what I learned from the user research I’ve been doing for Colophon Cards.\n\nMy oldest notebook\n\nThe post where I outline my general theory of notetaking for all to disagree with\nAt the end of my last post, I mentioned that I had switched to pen and paper notetaking in the early 2010s, after years of serious digital notetaking using plain text files.\nI wrote about how much more enjoyable the analogue notetaking was but what I didn’t mention was why I abandoned my plain text system. Nor did I write about my first foray into serious notetaking.\nThe notebook above, from 1994, is the oldest notebook of mine I’ve found. It’s the first proper notebook I kept. It wasn’t a journal, sketchbook, drafts, or workbook for school. Just notes.\nAnd it petered out pretty quickly. I had forgotten all about it until I found it in a box a few months ago. For a good reason: it was a random mess that I didn’t take seriously.\nNotetaking seriousness didn’t come for me until college, which makes sense. College is when I first started to test myself with more structured projects. Essays, theses, and my early blogging, all required a little bit more thought and planning than a teenager’s haphazard writing hobby.\nSerious writing required serious notetaking, both in terms of scheduling and structure. For years, I had a strict notetaking system. Each day I made a new text file with the current date as a file name. Each file was filled with whatever notes I needed for whatever I was working on at the time. Every day I wrote something, I crossed it off on the calendar with a black marker. On the days when I didn’t write something, I marked in red.\nThe goal was to keep the run of black unbroken. It worked. Sort of. This regimented system was based on a random quote from Jerry Seinfeld, of all people, and a misunderstanding on my part of the purpose of Julia Cameron’s Morning Pages from her book The Artist’s Way.\nI’d fallen into one of the oldest process trap of all: I had cargo culted methods whose principles, concepts, and motivations I did not understand. I had copied the ritual without understanding the mechanism.\nOver time this turned into a slog, _no matter what, write three pages!, and by the time I got to my PhD, it made everything about a bad experience worse.\nWhen I began my PhD in 2001, we were all still recovering from the dot-com crash. It made sense to work on a thesis that was grounded in an evolutionary, small-c conservative, view of media. Not only was web- and new media scepticism abundant at the time, it was very strong in the specific academic environment where I was working. Over the years that I worked on my PhD, that view became untenable to me. Interactive media—the web—was and is fundamentally different from its predecessors, in a way that promised to be completely revolutionary to both culture and society. But I was locked in a reactionary thesis. Starting from scratch would have almost inevitably led to me having to abandon the PhD. This meant that I had to write a thesis I utterly disagreed with, making an argument I didn’t believe in, using references that I felt were borderline nonsense in the context I was pulling them into, and making the words I wrote feel like ash.\nThe regimented daily pages notetaking routine made everything worse. It turned the writing process into a multi-year death march, filling the folders of my hard drive with unusable nonsense that I didn’t believe in then and don’t believe in now.\nI managed to complete and defend my PhD and swore to leave academia behind for the rest of my life.\nIt took me years to fully recover.\nTo get there—to recover from my unrelenting thesis death march—I had to get more thoughtful and serious about writing and my notetaking. As is the way of my people (overthinkers, that is), this meant research. Lots and lots of research. On writing. On creativity. On notes and notetaking. On planning. Even research on skills development, the cognitive component in expertise, as well as memory formation. I dug through the entire Cambridge Handbook of Expertise and Expert Performance (over 900 pages). I read fluffy, self-help books on creativity. I read serious studies on the effects stress has on memory formation. I read old books. I read new books. Some of them dated. Some of them timeless. Some worked. Some didn’t.\nI also began to understand the mechanism behind Julia Cameron’s morning pages, how it was supposed to work, and what it had in common with other approaches, even the ones that superficially look completely different.\nI began to understand, at least for my own purposes, what notetaking was for.\nAnd I think—based on the research I’ve been doing—that I’m not alone.\nIt’s all about boxes and maps.\n\nThe different kinds of notes\nI recently interviewed about a dozen people on their notetaking habits. Before that, I had done a survey.\nThere’s a lot to cover as notes seem to come in an endless variety. Even from a group as small as twelve people you already got more than twelve different kinds of notetaking:\n\nHousehold management (shopping lists, chores, etc.)\nTask management\nMnemonic notes (write to help you remember)\nVarious kinds of annotations\nShared work notes (meeting minutes, documentation, etc.)\nPersonal work notes\nIdea exploration\nJournalling\nScrapbooking (digital and analogue)\nResearch management\nOutlining\nInformation management (bookmarks and the like)\nProject management\nClient management\nConcept database (save your ideas)\n\n\nThe above list in blackboard form\n\nThis is not an exhaustive list. The closer you look, the more varieties of notetaking you find, even in such a small group of people.\nThere’s a temptation there to dig in, get into even more detail, and generally act as if you’ve hit a motherlode, a vein that’s rich and deep and rewarding. Just really get into it, interview dozens or hundreds of people, do study after study and spend years cataloguing all the varieties of notetaking\nBut that would be a mistake.\nWhen you’re in a domain where increasing the resolution and detail only reveals an escalating amount of previously undiscovered complexity, odds are you are tackling what E.F. Schumacher called a ‘divergent problem’. These problems aren’t technical. They can’t be broken down into parts to solve each part step by step. A problem like this becomes more complex and hard to solve under close analysis, not simpler and easier to solve. The more detail you see, the more conflicting data points you encounter and the harder it gets to reconcile the diversity you’re witnessing with a cohesive mental model.\nFrom A Guide for the Perplexed, page 126:\n\nI have said that to solve a problem is to kill it. There is nothing wrong with “killing” a convergent problem, for it relates to what remains after life, consciousness, and self-awareness have already been eliminated. But can—or should—divergent problems be killed? (The words “final solution” still have a terrible ring in the ears of my generation.)\nDivergent problems cannot be killed; they cannot be solved in the sense of establishing a “correct formula”; they can, however, be transcended. A pair of opposites—like freedom and order—are opposites at the level of ordinary life, but they cease to be opposites at the higher level, the really human level, where self-awareness plays its proper role.\n\nSo, when I step back, squint a bit, and stare at my blackboard and my notes, it strikes me that most of the notetaking methods the interviewees described are trying to answer at least one of the three following questions:\n\nHow do I manage my creativity?\nHow do I manage my knowledge?\nHow do I manage my understanding?\n\nOr, more to the point, the notetaking methods are a way for the writer to continuously ask themselves these questions and adjust their tactics as needed. None of the methods are prescriptive or rigid; they are all constantly being adapted.\nThe job of notes for creativity is to:\n\nGenerate ideas in a structured way through research and sketching.\nPreserve those ideas.\nExplore the ideas until they have gelled into a cohesive plan or solved a problem.\n\nThe job of notes for knowledge is to:\n\nExtend your memory to help you keep track of useful information (client data, meeting notes, references).\nConnect that information to your current tasks or projects so that you can find it when you need it.\n\nThe job of notes for understanding is to:\n\nBreak apart, reframe, and contextualise information and ideas so that they become a part of your own thought process.\nTurn learning into something you can outline in your own words.\n\nIn terms of software, that means we have these three broad approaches:\n\nNotes for creativity tend to favour loosely structured workspaces. Scrivener and Ulysses probably come the closest, though, in practice, I have doubts that either of them is loosely structured enough.\nNotes for knowledge favour databases, ‘everything-buckets’ (apps that expect you to store everything in them), and hypertextual ‘link-everything’ note apps.\nNotes for understanding tend to favour tools that have powerful writing or drawing features (which you favour will depend on your skill set and comfort).\n\nI don’t think you can make software that perfectly serves all three of these kinds of notetaking. Knowledge bases become too rigid to serve as workspaces for creativity. The creative spaces are too loosely structured to work well as knowledge bases. You can integrate writing and drawing tools in either, but that serves notetaking for understanding only up to a point. Most knowledge bases preserve too much detail and context, which gets in the way of reframing and contextualization. And too fully featured writing or drawing tools could make the creativity tools too complex to use.\nIn the parlance of roleplaying games, these are the three character statistics of your notetaking app, and you only get to assign 15 points between them. You could choose to be average in all three (5, 5, 5, uninteresting). You could choose to dump all of the points in one stat and be just plain bad at the rest, which would simplify the design a bit. Or, you could think of it as a priority list: most important, second important, unimportant (dump stat!).\n\n(If you aren’t familiar with RPGs, you can think of them as three sliders with a fixed sum of values between themselves. Every time you push a slider above ‘5’, another slider has to go down a corresponding amount.)\nHow would I divvy up the points for Colophon Cards? What would the Colophon Cards character sheet look like?\nAt the moment, I’m leaning towards this:\n\nCreativity: 7\nKnowledge: 2 (dump stat!)\nUnderstanding: 6\n\n\nA workspace that:\n\nFavours lightweight and flexible structure over detailed organisation and connections.\nPrioritises speed over accuracy when creating and finding notes.\nHas better-than-average writing tools.\n\nNow, I’m not going to pretend that I’m basing those priorities on the comparatively little user research I’ve been doing. They instead represent the kind of app I want to use and enjoy. Because it turns out that enjoyment is essential for long-term notetaking. The research helped me clarify what I wanted, give it focus, and place it properly in the larger context. But, ultimately, I want to make an app I enjoy.\nAlso, it made me drop a bunch of smaller ideas that research revealed to be less likely to work, but that’s honestly a little less interesting. Though possibly a topic for a future blog post.\n\nBoxes and Maps\nYou don’t have to copy the methods of a German academic with a tendency for the abstruse to take notes\nIn my relentless daily writing during my PhD, I had missed the point of it. By using a regimented notetaking structure I drove my creativity into the ground, my joy and motivation cratered with it, and burnout inevitably followed.\nWhat I had missed was that the point of these techniques wasn’t to continuously force march forward according to a predetermined master plan. Just writing or getting things done isn’t the purpose, at least not in any of the writing methods I’ve looked at.\nAnd I’ve looked at a few—they all cover some form of notetaking or journaling as a core part of their process:\nUmberto Eco’s How to Write a Thesis is a book about writing that contains a fully-formed (and very usable) notetaking system based on index cards. It’s structured so that everything hangs off the Table of Contents or outline. The thesis’s ToC becomes the map you use to structure your notes.\n(I wish that I had read Eco’s book before I did my thesis. Alas.)\nAnne Lamott’s Bird by Bird describes an ad hoc and improvised system of index cards. She presents it as an almost random process but then proceeds to spend an entire chapter explaining the value of a loosely structured notetaking system. Her notes are more of a box full of unsorted items that prod the work forward and guide it.\nA good chunk of David Hewson’s Writing: A User Manual is about how various kinds of notes help you write your book. His method has elements of both the Box and the Map. He recommends plotting and planning in advance, but he also uses an unstructured daily journal and a ‘box’ of notes on characters, concepts, places, and ideas to guide the process.\nThe Story Grid by Shawn Coyne is pretty much just an excel-based, fiction-oriented version of Eco’s “How to Write a Thesis”. Instead of Eco’s table of contents, the story grid uses a list of scenes. But it’s otherwise a very similar principle: the map guides the project and structures your notes. The map evolves as you go but no matter how much it changes it remains the primary organizing principle.\nBrenda Ueland, in her 1938 book If You Want to Write recommends keeping a “slovenly, headlong, impulsive, honest diary”. The way she puts it:\n\nWrite every day, or as often as you possibly can, as fast as and as carelessly as you possibly can, without reading it again, anything you happened to have thought, seen or felt the day before.\n\nIn her amazing The Creative Habit Twyla Tharp talks about The Box. A literal box. Each project of hers gets a box which is full of items that document the active research and work on that project. It’s filled with objects, notes, files, clippings, toys and just stuff. Some people store things in files. She prefers boxes.\nAnd, last but not least, the idea I had misunderstood so badly years ago, seems so clear today when I reread Julia Cameron’s words in The Artist’s Way:\n\nThere is no wrong way to do morning pages. These daily morning meanderings are not meant to be art. Or even writing. I stress that point to reassure the nonwriters working with this book. Writing is simply one of the tools. Pages are meant to be, simply, the act of moving the hand across the page and writing down whatever comes to mind. Nothing is too petty, too silly, too stupid, or too weird to be included.\n\nIt’s about re-contextualising your experiences, reading, thoughts, ideas, and goals in words. This serves both as a mnemonic and to increase understanding as the act of reframing it all in words, in black and white, serves to help your mind integrate it. It turns external ideas and information into integrated thoughts that you understand and can act on.\nFlipping to the next page, I can also immediately see the one paragraph that later led to all of my notetaking misery:\n\nMorning pages are nonnegotiable. Never skip or skimp on morning pages. Your mood doesn’t matter.\n\nIf you ever read her book, ignore this paragraph. Your mood does matter in the long run. Don’t beat yourself up about it. There are other ways to accomplish the same thing without torturing yourself. What’s especially galling is that I clearly didn’t finish reading the book at the time as its entire purpose is to prevent people from making the mistake that I made.\nOnce you take in these many approaches to writing and study them as wholes, as opposed to just teasing out individual components, you begin to spot a few common threads running through them, among both the Box and Map creators.\nThe first one is that the difference between the Box and the Map isn’t as great as you think.\nThose who favour the Box maintain an evolving internal map of where they are going with the project. The purpose of the items in the box is to both make it easy for you to maintain that internal representation and to give it enough context to adapt it to changing circumstances.\nThose who favour the Map instead flip this around. The map is external and evolving and serves to make it easy for you to maintain the context internally so that you can adapt the project to changing circumstances. The goal is the same. The methods are remarkably similar. It’s just a question of which bit is serving as a mnemonic for the other bits.\nEvidence boards are a compromise between the two that shows just how little the difference between the two is in actual practice. Depending on how you look at it, the evidence board is either the items of the box pinned to a board or a map that has been loosely transposed over to a wall.\nWhich general approach you should choose is entirely personal. As the difference is primarily in mnemonic tactics, the optimal approach depends on how your own memory and other cognitive processes work. Some people’s memory is “out of sight, out of mind.' Or, you might find it easy to remember details but have a harder time maintaining a big picture context. Some have an internalised heuristic or rule of thumb for how a project should work, so they only need reminders and bookmarks that they check against their mental rubric. Some have a hard time visualising the final product that is the goal of their project and so need a tactic that keeps them motivated and more observant of the bigger picture. People vary and so must their methods.\nThe tactic to use depends on how your mind works. Experiment. Try different approaches out. But, once you’ve found your process, trust that the overall process is roughly the same:\nCollect\nAll the things you fancy. Note down ideas and thoughts. Take notes on what you read. Take pictures. Sketch when the whim strikes. Collect what interests you in life using whatever method is the most convenient for you. Anne Lamott uses index cards. Twyla Tharp uses whatever can be collected in her boxes. David Hewson uses a notetaking app (Ulysses, last I heard). Some use pens and notebooks. Whatever you use, remember that these notes are necessarily only an intermediate form. They don’t become understanding or thoughts until you integrate them. You need to be able to review them, and storing them safely is always useful, but, paradoxically, notes aren’t the be all or end all of the notetaking process.\nContextualise\nThe purpose of the various journalling tactics as well as some of the mapping tactics (like the evidence board) is to get you into the habit of reframing and contextualising your thoughts, your reading, and your ideas. By reframing them in words (or sketches) you integrate them which makes them available to your thinking and decision-making processes. If you don’t integrate what you collect, are just building an ever more intimidating database of opaque words and alien ideas.\nAn external brain is a brain that can’t drive your thoughts and actions and will just make your work harder.\nA daily written journal is a common way to accomplish this integration. But people have also used daily sketches, voice memos (on tape in the olden days), or video diaries. The goal isn’t to preserve or convince but to reframe and understand in your own terms what you’ve experienced, read, and thought. Blogs work great. Twitter might be stretching it because of the character limit. Use whatever works for you.\nRule of thumb: let the contextualisation method match the bones of the project. A writing project benefits from writing tools.\nMap\nThe final part is the map, the bird’s eye picture of where you are, what lies ahead, and where you want to end up. It’ll start off vague, whatever tactic you use. As you work it’ll become clearer, no matter whether you’re maintaining it in your mind, on paper, or in an Excel spreadsheet. The map might end up being an outline, a diagram, a building plan, a list of tasks in Trello, or a list of issues on GitHub. It will change over time, but don’t worry if it doesn’t. It’s important to keep in mind that the map isn’t the end product, just one more tool among many to help you build the end product.\nWhat does this all have to do with a notetaking app?\nThe first, most obvious conclusion is that there is no one best method. The above meta-framework for notetaking is broad enough to encompass both Zettelkasten and Twyla Tharp’s boxes filled with stuff. If I’m right about notetaking methods being especially sensitive to individual variation in neurocognition, then there will never be one method or one app to rule all of notetaking.\nIt becomes a question then of deciding on what my own particular take on this software genre might be. And, if you’ve been following my earlier posts, you probably have some idea of the direction I’m taking. At least in broad strokes.\nBut the meta-framework doesn’t answer one, very important, question. One that people have been tackling since the dawn of humanity.\nWhat happens when you need to collaborate with other people?\nBecause nobody, not even your lone wolf novelist, truly works alone.\nSo…\nNext: the final entry in the Colophon Cards research blog series, where I write about how collaboration and sharing fit into all of this.",
      "content_html": "<p>This is the second entry of three where I go over what I learned from the user research I&rsquo;ve been doing for <a href=\"https://www.colophon.cards/\">Colophon Cards</a>.</p>\n<figure><img src=\"https://www.baldurbjarnason.com/images/2022/notes/oldest-notebook.jpg\" alt=\"The ratty old spiral notebook that is the oldest notebook I own\">\n<figcaption>My oldest notebook</figcaption>\n</figure>\n<h2 id=\"the-post-where-i-outline-my-general-theory-of-notetaking-for-all-to-disagree-with\">The post where I outline my general theory of notetaking for all to disagree with</h2>\n<p>At the end of <a href=\"https://www.baldurbjarnason.com/2022/why-people-use-markdown/\">my last post</a>, I mentioned that I had switched to pen and paper notetaking in the early 2010s, after years of serious digital notetaking using plain text files.</p>\n<p>I wrote about how much more enjoyable the analogue notetaking was but what I didn&rsquo;t mention was why I abandoned my plain text system. Nor did I write about my <em>first</em> foray into serious notetaking.</p>\n<p>The notebook above, from 1994, is the oldest notebook of mine I&rsquo;ve found. It&rsquo;s the first <em>proper</em> notebook I kept. It wasn&rsquo;t a journal, sketchbook, drafts, or workbook for school. Just notes.</p>\n<p>And it petered out pretty quickly. I had forgotten all about it until I found it in a box a few months ago. For a good reason: it was a random mess that I didn&rsquo;t take seriously.</p>\n<p>Notetaking seriousness didn&rsquo;t come for me until college, which makes sense. College is when I first started to test myself with more structured projects. Essays, theses, and my early blogging, all required a little bit more thought and planning than a teenager&rsquo;s haphazard writing hobby.</p>\n<p>Serious writing required serious notetaking, both in terms of scheduling and structure. For years, I had a strict notetaking system. Each day I made a new text file with the current date as a file name. Each file was filled with whatever notes I needed for whatever I was working on at the time. Every day I wrote something, I crossed it off on the calendar with a black marker. On the days when I didn&rsquo;t write something, I marked in red.</p>\n<p>The goal was to keep the run of black unbroken. It worked. Sort of. This regimented system was based on a random quote from Jerry Seinfeld, of all people, and a misunderstanding on my part of the purpose of Julia Cameron&rsquo;s <em>Morning Pages</em> from her book <a href=\"https://juliacameronlive.com/\"><em>The Artist&rsquo;s Way</em></a>.</p>\n<p>I&rsquo;d fallen into one of the oldest process trap of all: I had <a href=\"https://en.wikipedia.org/wiki/Cargo_cult\">cargo culted</a> methods whose principles, concepts, and motivations I did not understand. I had copied the ritual without understanding the mechanism.</p>\n<p>Over time this turned into a slog, _no matter what, write three pages!, and by the time I got to my PhD, it made everything about a bad experience worse.</p>\n<p>When I began my PhD in 2001, we were all still recovering from the dot-com crash. It made sense to work on a thesis that was grounded in an evolutionary, small-c conservative, view of media. Not only was web- and new media scepticism abundant at the time, it was very strong in the specific academic environment where I was working. Over the years that I worked on my PhD, that view became untenable to me. Interactive media&mdash;the web&mdash;was and is fundamentally different from its predecessors, in a way that promised to be completely revolutionary to both culture and society. But I was locked in a reactionary thesis. Starting from scratch would have almost inevitably led to me having to abandon the PhD. This meant that I had to write a thesis I utterly disagreed with, making an argument I didn&rsquo;t believe in, using references that I felt were borderline nonsense in the context I was pulling them into, and making the words I wrote feel like ash.</p>\n<p>The regimented daily pages notetaking routine made everything worse. It turned the writing process into a multi-year death march, filling the folders of my hard drive with unusable nonsense that I didn&rsquo;t believe in then and don&rsquo;t believe in now.</p>\n<p>I managed to complete and defend my PhD and swore to leave academia behind for the rest of my life.</p>\n<p>It took me years to fully recover.</p>\n<p>To get there&mdash;to recover from my unrelenting thesis death march&mdash;I had to get more thoughtful and serious about writing <em>and</em> my notetaking. As is the way of my people (overthinkers, that is), this meant research. Lots and lots of research. On writing. On creativity. On notes and notetaking. On planning. Even research on skills development, the cognitive component in expertise, as well as memory formation. I dug through the entire <em>Cambridge Handbook of Expertise and Expert Performance</em> (over 900 pages). I read fluffy, self-help books on creativity. I read serious studies on the effects stress has on memory formation. I <a href=\"https://archive.org/details/onartofwriting00quiluoft\">read</a> <a href=\"https://www.goodreads.com/book/show/248954.If_You_Want_to_Write\">old</a> <a href=\"https://archive.org/details/techniqueofnove00uzze\">books</a>. I <a href=\"https://books.google.is/books/about/Steering_the_Craft.html?id=nbZ7BgAAQBAJ&amp;redir_esc=y\">read</a> <a href=\"https://mckeestory.com/books/story/\">new</a> <a href=\"https://muse.jhu.edu/book/22739\">books</a>. Some of them dated. Some of them timeless. Some worked. Some didn&rsquo;t.</p>\n<p>I also began to understand the mechanism behind Julia Cameron&rsquo;s morning pages, how it was supposed to work, and what it had in common with other approaches, even the ones that superficially look completely different.</p>\n<p>I began to understand, at least for my own purposes, what notetaking was for.</p>\n<p>And I think&mdash;based on the research I&rsquo;ve been doing&mdash;that I&rsquo;m not alone.</p>\n<p>It&rsquo;s all about boxes and maps.</p>\n<hr>\n<h2 id=\"the-different-kinds-of-notes\">The different kinds of notes</h2>\n<p>I recently interviewed about a dozen people on their notetaking habits. Before that, I had done <a href=\"https://www.baldurbjarnason.com/2022/colophon-cards-user-survey/\">a survey</a>.</p>\n<p>There&rsquo;s a lot to cover as notes seem to come in an endless variety. Even from a group as small as twelve people you already got <em>more</em> than twelve different kinds of notetaking:</p>\n<ul>\n<li>Household management (shopping lists, chores, etc.)</li>\n<li>Task management</li>\n<li>Mnemonic notes (write to help <em>you</em> remember)</li>\n<li>Various kinds of annotations</li>\n<li>Shared work notes (meeting minutes, documentation, etc.)</li>\n<li>Personal work notes</li>\n<li>Idea exploration</li>\n<li>Journalling</li>\n<li>Scrapbooking (digital and analogue)</li>\n<li>Research management</li>\n<li>Outlining</li>\n<li>Information management (bookmarks and the like)</li>\n<li>Project management</li>\n<li>Client management</li>\n<li>Concept database (save your ideas)</li>\n</ul>\n<figure><img src=\"https://www.baldurbjarnason.com/images/2022/notes/notes-blackboard.jpg\" alt=\"A blackboard. On it I've written 'Notes. Workspace vs DB vs Mnemonic. Idea management. Mnemonic. Revision. Shared work --- wiki. Collaboration. Journaling. Problem solving. Idea exploration. Project Management. Task management. Client management. Research management. Concept databases. Rading. Fragmented context.\">\n<figcaption>The above list in blackboard form</figcaption>\n</figure>\n<p>This is not an exhaustive list. The closer you look, the more varieties of notetaking you find, even in such a small group of people.</p>\n<p>There&rsquo;s a temptation there to dig in, get into even more detail, and generally act as if you&rsquo;ve hit a motherlode, a vein that&rsquo;s rich and deep and rewarding. Just <em>really</em> get into it, interview dozens or hundreds of people, do study after study and spend years cataloguing all the varieties of notetaking</p>\n<p>But that would be a mistake.</p>\n<p>When you&rsquo;re in a domain where increasing the resolution and detail only reveals an escalating amount of previously undiscovered complexity, odds are you are tackling what E.F. Schumacher called a &lsquo;divergent problem&rsquo;. These problems aren&rsquo;t technical. They can&rsquo;t be broken down into parts to solve each part step by step. A problem like this becomes <em>more</em> complex and hard to solve under close analysis, not simpler and easier to solve. The more detail you see, the more conflicting data points you encounter and the harder it gets to reconcile the diversity you&rsquo;re witnessing with a cohesive mental model.</p>\n<p>From <em>A Guide for the Perplexed</em>, page 126:</p>\n<blockquote>\n<p>I have said that to solve a problem is to kill it. There is nothing wrong with &ldquo;killing&rdquo; a convergent problem, for it relates to what remains after life, consciousness, and self-awareness have already been eliminated. But can&mdash;or should&mdash;divergent problems be killed? (The words &ldquo;final solution&rdquo; still have a terrible ring in the ears of my generation.)</p>\n<p>Divergent problems cannot be killed; they cannot be solved in the sense of establishing a &ldquo;correct formula&rdquo;; they can, however, be transcended. A pair of opposites&mdash;like freedom and order&mdash;are opposites at the level of ordinary life, but they cease to be opposites at the higher level, the really <em>human</em> level, where self-awareness plays its proper role.</p>\n</blockquote>\n<p>So, when I step back, squint a bit, and stare at my blackboard and my notes, it strikes me that most of the notetaking methods the interviewees described are trying to answer at least one of the three following questions:</p>\n<ol>\n<li>How do I manage my creativity?</li>\n<li>How do I manage my knowledge?</li>\n<li>How do I manage my understanding?</li>\n</ol>\n<p>Or, more to the point, the notetaking methods are a way for the writer to continuously ask themselves these questions and adjust their tactics as needed. None of the methods are prescriptive or rigid; they are all constantly being adapted.</p>\n<p>The job of <em>notes for creativity</em> is to:</p>\n<ul>\n<li>Generate ideas in a structured way through research and sketching.</li>\n<li>Preserve those ideas.</li>\n<li>Explore the ideas until they have gelled into a cohesive plan or solved a problem.</li>\n</ul>\n<p>The job of <em>notes for knowledge</em> is to:</p>\n<ul>\n<li>Extend your memory to help you keep track of useful information (client data, meeting notes, references).</li>\n<li>Connect that information to your current tasks or projects so that you can find it when you need it.</li>\n</ul>\n<p>The job of <em>notes for understanding</em> is to:</p>\n<ul>\n<li>Break apart, reframe, and contextualise information and ideas so that they become a part of your own thought process.</li>\n<li>Turn learning into something you can outline in your own words.</li>\n</ul>\n<p>In terms of software, that means we have these three broad approaches:</p>\n<ul>\n<li>Notes for creativity tend to favour loosely structured workspaces. Scrivener and Ulysses probably come the closest, though, in practice, I have doubts that either of them is loosely structured <em>enough</em>.</li>\n<li>Notes for knowledge favour databases, &lsquo;everything-buckets&rsquo; (apps that expect you to store <em>everything</em> in them), and hypertextual &lsquo;link-everything&rsquo; note apps.</li>\n<li>Notes for understanding tend to favour tools that have powerful writing or drawing features (which you favour will depend on your skill set and comfort).</li>\n</ul>\n<p>I don&rsquo;t think you can make software that perfectly serves all three of these kinds of notetaking. Knowledge bases become too rigid to serve as workspaces for creativity. The creative spaces are too loosely structured to work well as knowledge bases. You can integrate writing and drawing tools in either, but that serves notetaking for understanding only up to a point. Most knowledge bases preserve too much detail and context, which gets in the way of reframing and contextualization. And too fully featured writing or drawing tools could make the creativity tools too complex to use.</p>\n<p>In the parlance of roleplaying games, these are the three character statistics of your notetaking app, and you only get to assign 15 points between them. You could choose to be average in all three (5, 5, 5, uninteresting). You could choose to dump all of the points in one stat and be just plain bad at the rest, which would simplify the design a bit. Or, you could think of it as a priority list: most important, second important, unimportant (dump stat!).</p>\n<img src=\"https://www.baldurbjarnason.com/images/2022/notes/the-three-stats.jpg\" alt=\"'The three stats of note app design.' Followed by a table where Creativity, Knowledge, and Understanding run down the side and the numbers 1-10 run along the top. At the bottom: 'You have 15 points!'\">\n<p>(If you aren&rsquo;t familiar with RPGs, you can think of them as three sliders with a fixed sum of values between themselves. Every time you push a slider above &lsquo;5&rsquo;, another slider has to go down a corresponding amount.)</p>\n<p>How would I divvy up the points for Colophon Cards? What would the Colophon Cards character sheet look like?</p>\n<p>At the moment, I&rsquo;m leaning towards this:</p>\n<ul>\n<li>Creativity: 7</li>\n<li>Knowledge: 2 (dump stat!)</li>\n<li>Understanding: 6</li>\n</ul>\n<img src=\"https://www.baldurbjarnason.com/images/2022/notes/the-three-stats-colophon-cards.jpg\" alt=\"The same image as above except this one has the values coloured in as bars: Creativity: 7, Knowledge: 2, Understanding: 6.\">\n<p>A workspace that:</p>\n<ol>\n<li>Favours lightweight and flexible structure over detailed organisation and connections.</li>\n<li>Prioritises speed over accuracy when creating and finding notes.</li>\n<li>Has better-than-average writing tools.</li>\n</ol>\n<p>Now, I&rsquo;m not going to pretend that I&rsquo;m basing those priorities on the comparatively little user research I&rsquo;ve been doing. They instead represent the kind of app <em>I</em> want to use and <em>enjoy</em>. Because it turns out that enjoyment is <em>essential</em> for long-term notetaking. The research helped me clarify what I wanted, give it focus, and place it properly in the larger context. But, ultimately, I want to make an app I enjoy.</p>\n<p>Also, it made me drop a bunch of smaller ideas that research revealed to be less likely to work, but that&rsquo;s honestly a little less interesting. Though possibly a topic for a future blog post.</p>\n<hr>\n<h2 id=\"boxes-and-maps\">Boxes and Maps</h2>\n<h3 id=\"you-dont-have-to-copy-the-methods-of-a-german-academic-with-a-tendency-for-the-abstruse-to-take-notes\">You don&rsquo;t have to copy the methods of a German academic with a tendency for the abstruse to take notes</h3>\n<p>In my relentless daily writing during my PhD, I had missed the point of it. By using a regimented notetaking structure I drove my creativity into the ground, my joy and motivation cratered with it, and burnout inevitably followed.</p>\n<p>What I had missed was that the point of these techniques wasn&rsquo;t to continuously force march forward according to a predetermined master plan. Just writing or getting things done isn&rsquo;t the purpose, at least not in any of the writing methods I&rsquo;ve looked at.</p>\n<p>And I&rsquo;ve looked at a few&mdash;they all cover some form of notetaking or journaling as a core part of their process:</p>\n<p>Umberto Eco&rsquo;s <em><a href=\"https://mitpress.mit.edu/books/how-write-thesis\">How to Write a Thesis</a></em> is a book about writing that contains a fully-formed (and very usable) notetaking system based on index cards. It&rsquo;s structured so that everything hangs off the Table of Contents or outline. The thesis&rsquo;s ToC becomes the map you use to structure your notes.</p>\n<p>(I wish that I had read Eco&rsquo;s book before I did my thesis. Alas.)</p>\n<p>Anne Lamott&rsquo;s <em><a href=\"https://www.penguinrandomhouse.com/books/97395/bird-by-bird-by-anne-lamott/\">Bird by Bird</a></em> describes an ad hoc and improvised system of index cards. She presents it as an almost random process but then proceeds to spend an entire chapter explaining the value of a loosely structured notetaking system. Her notes are more of a box full of unsorted items that prod the work forward and guide it.</p>\n<p>A good chunk of David Hewson&rsquo;s <em><a href=\"https://davidhewson.com/on-writing/\">Writing: A User Manual</a></em> is about how various kinds of notes help you write your book. His method has elements of both the Box and the Map. He recommends plotting and planning in advance, but he also uses an unstructured daily journal and a &lsquo;box&rsquo; of notes on characters, concepts, places, and ideas to guide the process.</p>\n<p>The <em><a href=\"https://storygrid.com/\">Story Grid</a></em> by Shawn Coyne is pretty much just an excel-based, fiction-oriented version of Eco&rsquo;s &ldquo;How to Write a Thesis&rdquo;. Instead of Eco&rsquo;s table of contents, the story grid uses a list of scenes. But it&rsquo;s otherwise a very similar principle: the map guides the project and structures your notes. The map evolves as you go but no matter how much it changes it remains the primary organizing principle.</p>\n<p>Brenda Ueland, in her 1938 book <a href=\"https://www.goodreads.com/book/show/248954.If_You_Want_to_Write\"><em>If You Want to Write</em></a> recommends keeping a &ldquo;slovenly, headlong, impulsive, honest diary&rdquo;. The way she puts it:</p>\n<blockquote>\n<p>Write every day, or as often as you possibly can, as fast as and as carelessly as you possibly can, without reading it again, anything you happened to have thought, seen or felt the day before.</p>\n</blockquote>\n<p>In her amazing <em><a href=\"https://www.simonandschuster.com/books/The-Creative-Habit/Twyla-Tharp/9780743235273\">The Creative Habit</a></em> Twyla Tharp talks about The Box. A literal box. Each project of hers gets a box which is full of items that document the active research and work on that project. It&rsquo;s filled with objects, notes, files, clippings, toys and just <em>stuff</em>. Some people store things in files. She prefers boxes.</p>\n<p>And, last but not least, the idea I had misunderstood so badly years ago, seems so clear today when I reread Julia Cameron&rsquo;s words in <em>The Artist&rsquo;s Way</em>:</p>\n<blockquote>\n<p><em>There is no wrong way to do morning pages</em>. These daily morning meanderings are not meant to be <em>art</em>. Or even <em>writing</em>. I stress that point to reassure the nonwriters working with this book. Writing is simply one of the tools. Pages are meant to be, simply, the act of moving the hand across the page and writing down <em>whatever</em> comes to mind. Nothing is too petty, too silly, too stupid, or too weird to be included.</p>\n</blockquote>\n<p>It&rsquo;s about re-contextualising your experiences, reading, thoughts, ideas, and goals in words. This serves both as a mnemonic and to increase understanding as the act of reframing it all in words, in black and white, serves to help your mind integrate it. It turns external ideas and information into integrated thoughts that you understand and can act on.</p>\n<p>Flipping to the next page, I can also immediately see the one paragraph that later led to all of my notetaking misery:</p>\n<blockquote>\n<p><em>Morning pages are nonnegotiable</em>. Never skip or skimp on morning pages. Your mood doesn&rsquo;t matter.</p>\n</blockquote>\n<p>If you ever read her book, ignore this paragraph. Your mood does matter in the long run. Don&rsquo;t beat yourself up about it. There are other ways to accomplish the same thing without torturing yourself. What&rsquo;s especially galling is that I clearly didn&rsquo;t finish reading the book at the time as its entire purpose is to prevent people from making the mistake that I made.</p>\n<p>Once you take in these many approaches to writing and study them as wholes, as opposed to just teasing out individual components, you begin to spot a few common threads running through them, among both the Box and Map creators.</p>\n<p>The first one is that the difference between the Box and the Map isn&rsquo;t as great as you think.</p>\n<p>Those who favour <em>the Box</em> maintain an evolving <em>internal</em> map of where they are going with the project. The purpose of the items in the box is to both make it easy for you to maintain that internal representation and to give it enough context to adapt it to changing circumstances.</p>\n<p>Those who favour <em>the Map</em> instead flip this around. The map is external and evolving and serves to make it easy for you to maintain the context <em>internally</em> so that you can adapt the project to changing circumstances. The goal is the same. The methods are remarkably similar. It&rsquo;s just a question of which bit is serving as a mnemonic for the other bits.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Evidence_board\"><em>Evidence boards</em></a> are a compromise between the two that shows just how little the difference between the two is in actual practice. Depending on how you look at it, the evidence board is either the items of the box pinned to a board or a map that has been loosely transposed over to a wall.</p>\n<p>Which general approach you should choose is entirely personal. As the difference is primarily in mnemonic tactics, the optimal approach depends on how your own memory and other cognitive processes work. Some people&rsquo;s memory is &ldquo;out of sight, out of mind.' Or, you might find it easy to remember details but have a harder time maintaining a big picture context. Some have an internalised heuristic or rule of thumb for how a project should work, so they only need reminders and bookmarks that they check against their mental rubric. Some have a hard time visualising the final product that is the goal of their project and so need a tactic that keeps them motivated and more observant of the bigger picture. People vary and so must their methods.</p>\n<p>The tactic to use depends on how your mind works. Experiment. Try different approaches out. But, once you&rsquo;ve found your process, trust that the overall process is roughly the same:</p>\n<h3 id=\"collect\">Collect</h3>\n<p>All the things you fancy. Note down ideas and thoughts. Take notes on what you read. Take pictures. Sketch when the whim strikes. Collect what interests you in life using whatever method is the most convenient for you. Anne Lamott uses index cards. Twyla Tharp uses whatever can be collected in her boxes. David Hewson uses a notetaking app (Ulysses, last I heard). Some use pens and notebooks. Whatever you use, remember that these notes are necessarily only an intermediate form. They don&rsquo;t become understanding or thoughts until you integrate them. You need to be able to review them, and storing them safely is always useful, but, paradoxically, notes aren&rsquo;t the be all or end all of the notetaking process.</p>\n<h3 id=\"contextualise\">Contextualise</h3>\n<p>The purpose of the various journalling tactics as well as some of the mapping tactics (like the evidence board) is to get you into the habit of reframing and contextualising your thoughts, your reading, and your ideas. By reframing them in words (or sketches) you integrate them which makes them available to your thinking and decision-making processes. If you don&rsquo;t integrate what you collect, are just building an ever more intimidating database of opaque words and alien ideas.</p>\n<p>An external brain is a brain that can&rsquo;t drive your thoughts and actions and will just make your work harder.</p>\n<p>A daily written journal is a common way to accomplish this integration. But people have also used daily sketches, voice memos (on tape in the olden days), or video diaries. The goal isn&rsquo;t to preserve or convince but to reframe and understand in your own terms what you&rsquo;ve experienced, read, and thought. Blogs work great. Twitter might be stretching it because of the character limit. Use whatever works for you.</p>\n<p>Rule of thumb: let the contextualisation method match the bones of the project. A writing project benefits from writing tools.</p>\n<h3 id=\"map\">Map</h3>\n<p>The final part is the map, the bird&rsquo;s eye picture of where you are, what lies ahead, and where you want to end up. It&rsquo;ll start off vague, whatever tactic you use. As you work it&rsquo;ll become clearer, no matter whether you&rsquo;re maintaining it in your mind, on paper, or in an Excel spreadsheet. The map might end up being an outline, a diagram, a building plan, a list of tasks in Trello, or a list of issues on GitHub. It <em>will</em> change over time, but don&rsquo;t worry if it doesn&rsquo;t. It&rsquo;s important to keep in mind that the map <em>isn&rsquo;t</em> the end product, just one more tool among many to help you build the end product.</p>\n<h2 id=\"what-does-this-all-have-to-do-with-a-notetaking-app\">What does this all have to do with a notetaking app?</h2>\n<p>The first, most obvious conclusion is that there is no one best method. The above meta-framework for notetaking is broad enough to encompass both Zettelkasten and Twyla Tharp&rsquo;s boxes filled with stuff. If I&rsquo;m right about notetaking methods being especially sensitive to individual variation in neurocognition, then there will never be one method or one app to rule all of notetaking.</p>\n<p>It becomes a question then of deciding on what my own particular take on this software genre might be. And, if you&rsquo;ve been following my earlier posts, you probably have some idea of the direction I&rsquo;m taking. At least in broad strokes.</p>\n<p>But the meta-framework doesn&rsquo;t answer one, very important, question. One that people have been tackling since the dawn of humanity.</p>\n<p>What happens when you need to collaborate with other people?</p>\n<p>Because nobody, not even your lone wolf novelist, truly works alone.</p>\n<p>So&hellip;</p>\n<p>Next: the final entry in the Colophon Cards research blog series, where I write about how collaboration and sharing fit into all of this.</p>",
      "content_text": "This is the second entry of three where I go over what I learned from the user research I’ve been doing for Colophon Cards.\n\nMy oldest notebook\n\nThe post where I outline my general theory of notetaking for all to disagree with\nAt the end of my last post, I mentioned that I had switched to pen and paper notetaking in the early 2010s, after years of serious digital notetaking using plain text files.\nI wrote about how much more enjoyable the analogue notetaking was but what I didn’t mention was why I abandoned my plain text system. Nor did I write about my first foray into serious notetaking.\nThe notebook above, from 1994, is the oldest notebook of mine I’ve found. It’s the first proper notebook I kept. It wasn’t a journal, sketchbook, drafts, or workbook for school. Just notes.\nAnd it petered out pretty quickly. I had forgotten all about it until I found it in a box a few months ago. For a good reason: it was a random mess that I didn’t take seriously.\nNotetaking seriousness didn’t come for me until college, which makes sense. College is when I first started to test myself with more structured projects. Essays, theses, and my early blogging, all required a little bit more thought and planning than a teenager’s haphazard writing hobby.\nSerious writing required serious notetaking, both in terms of scheduling and structure. For years, I had a strict notetaking system. Each day I made a new text file with the current date as a file name. Each file was filled with whatever notes I needed for whatever I was working on at the time. Every day I wrote something, I crossed it off on the calendar with a black marker. On the days when I didn’t write something, I marked in red.\nThe goal was to keep the run of black unbroken. It worked. Sort of. This regimented system was based on a random quote from Jerry Seinfeld, of all people, and a misunderstanding on my part of the purpose of Julia Cameron’s Morning Pages from her book The Artist’s Way.\nI’d fallen into one of the oldest process trap of all: I had cargo culted methods whose principles, concepts, and motivations I did not understand. I had copied the ritual without understanding the mechanism.\nOver time this turned into a slog, _no matter what, write three pages!, and by the time I got to my PhD, it made everything about a bad experience worse.\nWhen I began my PhD in 2001, we were all still recovering from the dot-com crash. It made sense to work on a thesis that was grounded in an evolutionary, small-c conservative, view of media. Not only was web- and new media scepticism abundant at the time, it was very strong in the specific academic environment where I was working. Over the years that I worked on my PhD, that view became untenable to me. Interactive media—the web—was and is fundamentally different from its predecessors, in a way that promised to be completely revolutionary to both culture and society. But I was locked in a reactionary thesis. Starting from scratch would have almost inevitably led to me having to abandon the PhD. This meant that I had to write a thesis I utterly disagreed with, making an argument I didn’t believe in, using references that I felt were borderline nonsense in the context I was pulling them into, and making the words I wrote feel like ash.\nThe regimented daily pages notetaking routine made everything worse. It turned the writing process into a multi-year death march, filling the folders of my hard drive with unusable nonsense that I didn’t believe in then and don’t believe in now.\nI managed to complete and defend my PhD and swore to leave academia behind for the rest of my life.\nIt took me years to fully recover.\nTo get there—to recover from my unrelenting thesis death march—I had to get more thoughtful and serious about writing and my notetaking. As is the way of my people (overthinkers, that is), this meant research. Lots and lots of research. On writing. On creativity. On notes and notetaking. On planning. Even research on skills development, the cognitive component in expertise, as well as memory formation. I dug through the entire Cambridge Handbook of Expertise and Expert Performance (over 900 pages). I read fluffy, self-help books on creativity. I read serious studies on the effects stress has on memory formation. I read old books. I read new books. Some of them dated. Some of them timeless. Some worked. Some didn’t.\nI also began to understand the mechanism behind Julia Cameron’s morning pages, how it was supposed to work, and what it had in common with other approaches, even the ones that superficially look completely different.\nI began to understand, at least for my own purposes, what notetaking was for.\nAnd I think—based on the research I’ve been doing—that I’m not alone.\nIt’s all about boxes and maps.\n\nThe different kinds of notes\nI recently interviewed about a dozen people on their notetaking habits. Before that, I had done a survey.\nThere’s a lot to cover as notes seem to come in an endless variety. Even from a group as small as twelve people you already got more than twelve different kinds of notetaking:\n\nHousehold management (shopping lists, chores, etc.)\nTask management\nMnemonic notes (write to help you remember)\nVarious kinds of annotations\nShared work notes (meeting minutes, documentation, etc.)\nPersonal work notes\nIdea exploration\nJournalling\nScrapbooking (digital and analogue)\nResearch management\nOutlining\nInformation management (bookmarks and the like)\nProject management\nClient management\nConcept database (save your ideas)\n\n\nThe above list in blackboard form\n\nThis is not an exhaustive list. The closer you look, the more varieties of notetaking you find, even in such a small group of people.\nThere’s a temptation there to dig in, get into even more detail, and generally act as if you’ve hit a motherlode, a vein that’s rich and deep and rewarding. Just really get into it, interview dozens or hundreds of people, do study after study and spend years cataloguing all the varieties of notetaking\nBut that would be a mistake.\nWhen you’re in a domain where increasing the resolution and detail only reveals an escalating amount of previously undiscovered complexity, odds are you are tackling what E.F. Schumacher called a ‘divergent problem’. These problems aren’t technical. They can’t be broken down into parts to solve each part step by step. A problem like this becomes more complex and hard to solve under close analysis, not simpler and easier to solve. The more detail you see, the more conflicting data points you encounter and the harder it gets to reconcile the diversity you’re witnessing with a cohesive mental model.\nFrom A Guide for the Perplexed, page 126:\n\nI have said that to solve a problem is to kill it. There is nothing wrong with “killing” a convergent problem, for it relates to what remains after life, consciousness, and self-awareness have already been eliminated. But can—or should—divergent problems be killed? (The words “final solution” still have a terrible ring in the ears of my generation.)\nDivergent problems cannot be killed; they cannot be solved in the sense of establishing a “correct formula”; they can, however, be transcended. A pair of opposites—like freedom and order—are opposites at the level of ordinary life, but they cease to be opposites at the higher level, the really human level, where self-awareness plays its proper role.\n\nSo, when I step back, squint a bit, and stare at my blackboard and my notes, it strikes me that most of the notetaking methods the interviewees described are trying to answer at least one of the three following questions:\n\nHow do I manage my creativity?\nHow do I manage my knowledge?\nHow do I manage my understanding?\n\nOr, more to the point, the notetaking methods are a way for the writer to continuously ask themselves these questions and adjust their tactics as needed. None of the methods are prescriptive or rigid; they are all constantly being adapted.\nThe job of notes for creativity is to:\n\nGenerate ideas in a structured way through research and sketching.\nPreserve those ideas.\nExplore the ideas until they have gelled into a cohesive plan or solved a problem.\n\nThe job of notes for knowledge is to:\n\nExtend your memory to help you keep track of useful information (client data, meeting notes, references).\nConnect that information to your current tasks or projects so that you can find it when you need it.\n\nThe job of notes for understanding is to:\n\nBreak apart, reframe, and contextualise information and ideas so that they become a part of your own thought process.\nTurn learning into something you can outline in your own words.\n\nIn terms of software, that means we have these three broad approaches:\n\nNotes for creativity tend to favour loosely structured workspaces. Scrivener and Ulysses probably come the closest, though, in practice, I have doubts that either of them is loosely structured enough.\nNotes for knowledge favour databases, ‘everything-buckets’ (apps that expect you to store everything in them), and hypertextual ‘link-everything’ note apps.\nNotes for understanding tend to favour tools that have powerful writing or drawing features (which you favour will depend on your skill set and comfort).\n\nI don’t think you can make software that perfectly serves all three of these kinds of notetaking. Knowledge bases become too rigid to serve as workspaces for creativity. The creative spaces are too loosely structured to work well as knowledge bases. You can integrate writing and drawing tools in either, but that serves notetaking for understanding only up to a point. Most knowledge bases preserve too much detail and context, which gets in the way of reframing and contextualization. And too fully featured writing or drawing tools could make the creativity tools too complex to use.\nIn the parlance of roleplaying games, these are the three character statistics of your notetaking app, and you only get to assign 15 points between them. You could choose to be average in all three (5, 5, 5, uninteresting). You could choose to dump all of the points in one stat and be just plain bad at the rest, which would simplify the design a bit. Or, you could think of it as a priority list: most important, second important, unimportant (dump stat!).\n\n(If you aren’t familiar with RPGs, you can think of them as three sliders with a fixed sum of values between themselves. Every time you push a slider above ‘5’, another slider has to go down a corresponding amount.)\nHow would I divvy up the points for Colophon Cards? What would the Colophon Cards character sheet look like?\nAt the moment, I’m leaning towards this:\n\nCreativity: 7\nKnowledge: 2 (dump stat!)\nUnderstanding: 6\n\n\nA workspace that:\n\nFavours lightweight and flexible structure over detailed organisation and connections.\nPrioritises speed over accuracy when creating and finding notes.\nHas better-than-average writing tools.\n\nNow, I’m not going to pretend that I’m basing those priorities on the comparatively little user research I’ve been doing. They instead represent the kind of app I want to use and enjoy. Because it turns out that enjoyment is essential for long-term notetaking. The research helped me clarify what I wanted, give it focus, and place it properly in the larger context. But, ultimately, I want to make an app I enjoy.\nAlso, it made me drop a bunch of smaller ideas that research revealed to be less likely to work, but that’s honestly a little less interesting. Though possibly a topic for a future blog post.\n\nBoxes and Maps\nYou don’t have to copy the methods of a German academic with a tendency for the abstruse to take notes\nIn my relentless daily writing during my PhD, I had missed the point of it. By using a regimented notetaking structure I drove my creativity into the ground, my joy and motivation cratered with it, and burnout inevitably followed.\nWhat I had missed was that the point of these techniques wasn’t to continuously force march forward according to a predetermined master plan. Just writing or getting things done isn’t the purpose, at least not in any of the writing methods I’ve looked at.\nAnd I’ve looked at a few—they all cover some form of notetaking or journaling as a core part of their process:\nUmberto Eco’s How to Write a Thesis is a book about writing that contains a fully-formed (and very usable) notetaking system based on index cards. It’s structured so that everything hangs off the Table of Contents or outline. The thesis’s ToC becomes the map you use to structure your notes.\n(I wish that I had read Eco’s book before I did my thesis. Alas.)\nAnne Lamott’s Bird by Bird describes an ad hoc and improvised system of index cards. She presents it as an almost random process but then proceeds to spend an entire chapter explaining the value of a loosely structured notetaking system. Her notes are more of a box full of unsorted items that prod the work forward and guide it.\nA good chunk of David Hewson’s Writing: A User Manual is about how various kinds of notes help you write your book. His method has elements of both the Box and the Map. He recommends plotting and planning in advance, but he also uses an unstructured daily journal and a ‘box’ of notes on characters, concepts, places, and ideas to guide the process.\nThe Story Grid by Shawn Coyne is pretty much just an excel-based, fiction-oriented version of Eco’s “How to Write a Thesis”. Instead of Eco’s table of contents, the story grid uses a list of scenes. But it’s otherwise a very similar principle: the map guides the project and structures your notes. The map evolves as you go but no matter how much it changes it remains the primary organizing principle.\nBrenda Ueland, in her 1938 book If You Want to Write recommends keeping a “slovenly, headlong, impulsive, honest diary”. The way she puts it:\n\nWrite every day, or as often as you possibly can, as fast as and as carelessly as you possibly can, without reading it again, anything you happened to have thought, seen or felt the day before.\n\nIn her amazing The Creative Habit Twyla Tharp talks about The Box. A literal box. Each project of hers gets a box which is full of items that document the active research and work on that project. It’s filled with objects, notes, files, clippings, toys and just stuff. Some people store things in files. She prefers boxes.\nAnd, last but not least, the idea I had misunderstood so badly years ago, seems so clear today when I reread Julia Cameron’s words in The Artist’s Way:\n\nThere is no wrong way to do morning pages. These daily morning meanderings are not meant to be art. Or even writing. I stress that point to reassure the nonwriters working with this book. Writing is simply one of the tools. Pages are meant to be, simply, the act of moving the hand across the page and writing down whatever comes to mind. Nothing is too petty, too silly, too stupid, or too weird to be included.\n\nIt’s about re-contextualising your experiences, reading, thoughts, ideas, and goals in words. This serves both as a mnemonic and to increase understanding as the act of reframing it all in words, in black and white, serves to help your mind integrate it. It turns external ideas and information into integrated thoughts that you understand and can act on.\nFlipping to the next page, I can also immediately see the one paragraph that later led to all of my notetaking misery:\n\nMorning pages are nonnegotiable. Never skip or skimp on morning pages. Your mood doesn’t matter.\n\nIf you ever read her book, ignore this paragraph. Your mood does matter in the long run. Don’t beat yourself up about it. There are other ways to accomplish the same thing without torturing yourself. What’s especially galling is that I clearly didn’t finish reading the book at the time as its entire purpose is to prevent people from making the mistake that I made.\nOnce you take in these many approaches to writing and study them as wholes, as opposed to just teasing out individual components, you begin to spot a few common threads running through them, among both the Box and Map creators.\nThe first one is that the difference between the Box and the Map isn’t as great as you think.\nThose who favour the Box maintain an evolving internal map of where they are going with the project. The purpose of the items in the box is to both make it easy for you to maintain that internal representation and to give it enough context to adapt it to changing circumstances.\nThose who favour the Map instead flip this around. The map is external and evolving and serves to make it easy for you to maintain the context internally so that you can adapt the project to changing circumstances. The goal is the same. The methods are remarkably similar. It’s just a question of which bit is serving as a mnemonic for the other bits.\nEvidence boards are a compromise between the two that shows just how little the difference between the two is in actual practice. Depending on how you look at it, the evidence board is either the items of the box pinned to a board or a map that has been loosely transposed over to a wall.\nWhich general approach you should choose is entirely personal. As the difference is primarily in mnemonic tactics, the optimal approach depends on how your own memory and other cognitive processes work. Some people’s memory is “out of sight, out of mind.' Or, you might find it easy to remember details but have a harder time maintaining a big picture context. Some have an internalised heuristic or rule of thumb for how a project should work, so they only need reminders and bookmarks that they check against their mental rubric. Some have a hard time visualising the final product that is the goal of their project and so need a tactic that keeps them motivated and more observant of the bigger picture. People vary and so must their methods.\nThe tactic to use depends on how your mind works. Experiment. Try different approaches out. But, once you’ve found your process, trust that the overall process is roughly the same:\nCollect\nAll the things you fancy. Note down ideas and thoughts. Take notes on what you read. Take pictures. Sketch when the whim strikes. Collect what interests you in life using whatever method is the most convenient for you. Anne Lamott uses index cards. Twyla Tharp uses whatever can be collected in her boxes. David Hewson uses a notetaking app (Ulysses, last I heard). Some use pens and notebooks. Whatever you use, remember that these notes are necessarily only an intermediate form. They don’t become understanding or thoughts until you integrate them. You need to be able to review them, and storing them safely is always useful, but, paradoxically, notes aren’t the be all or end all of the notetaking process.\nContextualise\nThe purpose of the various journalling tactics as well as some of the mapping tactics (like the evidence board) is to get you into the habit of reframing and contextualising your thoughts, your reading, and your ideas. By reframing them in words (or sketches) you integrate them which makes them available to your thinking and decision-making processes. If you don’t integrate what you collect, are just building an ever more intimidating database of opaque words and alien ideas.\nAn external brain is a brain that can’t drive your thoughts and actions and will just make your work harder.\nA daily written journal is a common way to accomplish this integration. But people have also used daily sketches, voice memos (on tape in the olden days), or video diaries. The goal isn’t to preserve or convince but to reframe and understand in your own terms what you’ve experienced, read, and thought. Blogs work great. Twitter might be stretching it because of the character limit. Use whatever works for you.\nRule of thumb: let the contextualisation method match the bones of the project. A writing project benefits from writing tools.\nMap\nThe final part is the map, the bird’s eye picture of where you are, what lies ahead, and where you want to end up. It’ll start off vague, whatever tactic you use. As you work it’ll become clearer, no matter whether you’re maintaining it in your mind, on paper, or in an Excel spreadsheet. The map might end up being an outline, a diagram, a building plan, a list of tasks in Trello, or a list of issues on GitHub. It will change over time, but don’t worry if it doesn’t. It’s important to keep in mind that the map isn’t the end product, just one more tool among many to help you build the end product.\nWhat does this all have to do with a notetaking app?\nThe first, most obvious conclusion is that there is no one best method. The above meta-framework for notetaking is broad enough to encompass both Zettelkasten and Twyla Tharp’s boxes filled with stuff. If I’m right about notetaking methods being especially sensitive to individual variation in neurocognition, then there will never be one method or one app to rule all of notetaking.\nIt becomes a question then of deciding on what my own particular take on this software genre might be. And, if you’ve been following my earlier posts, you probably have some idea of the direction I’m taking. At least in broad strokes.\nBut the meta-framework doesn’t answer one, very important, question. One that people have been tackling since the dawn of humanity.\nWhat happens when you need to collaborate with other people?\nBecause nobody, not even your lone wolf novelist, truly works alone.\nSo…\nNext: the final entry in the Colophon Cards research blog series, where I write about how collaboration and sharing fit into all of this.",
      "date_published": "2022-05-06T12:56:06.000Z",
      "date_modified": "2022-05-06T12:56:06.000Z"
    }
  ],
  "description": "Recent content on Baldur Bjarnason",
  "home_page_url": "https://www.baldurbjarnason.com/"
}